<HTML>
<HEAD>
  <META NAME="GENERATOR" CONTENT="Adobe PageMill 2.0 Win">
  <TITLE>Alan Turing</TITLE>
</HEAD>
<BODY BACKGROUND="fondo.jpg">

<H2><CENTER>Alan Turing.</CENTER></H2>

<BLOCKQUOTE>
  <P><BR>
  &quot;El ingl&eacute;s Alan Turing (1912-1954) puede ser considerado el
  padre de la Inteligencia Artificial (IA), aunque este nombre no se usase
  hasta despu&eacute;s de 1956. Turing estudi&oacute; l&oacute;gica matem&aacute;tica
  en la Universidad de Cambridge y en 1937 estuvo en el Institute for Advanced
  Studies de Princeton, donde estaban G&ouml;del y Von Newman, entre otros
  destacados l&oacute;gicos y matem&aacute;ticos, adem&aacute;s de Albert
  Einstein Durante la segunda guerra mundial trabaj&oacute; para su pa&iacute;s
  en los servicios de informaci&oacute;n; en 1949 en la Universidad de Manchester
  y en el programa MADAM (Manchester Authomatic Digital Machine) que result&oacute;
  ser el equipo de computaci&oacute;n de mayor memoria construido hasta entonces.
  Condenado a causa de su homosexualidad a un tratamiento, o tortura, m&eacute;dico-farmac&eacute;utica
  equivalente a la castraci&oacute;n, Turing se suicid&oacute; por envenenamiento
  en 1954.&quot; (Enric Trillas50-51)<BR>
  &quot;Durante los a&ntilde;os de la segunda guerra mundial, Turing colabor&oacute;
  en el dise&ntilde;o de una m&aacute;quina llamada la &#145;Bomba&#146;
  que exploraba las combinaciones posibles generadas por la m&aacute;quina
  codificadora alemana &#145;Enigma&#146;. Tal &#145;Bomba&#146; fue una
  m&aacute;quina de prop&oacute;sito especial, el de descifrar c&oacute;digos,
  construida electromec&aacute;nicamente con rel&eacute;s. Asimismo, trabaj&oacute;
  en el desarrollo de la &#145;Colossus&#146; (que algunos consideran como
  el primer ordenador electr&oacute;nico) que ya funcionaba con v&aacute;lvulas
  (tubos de vac&iacute;o) en lugar de rel&eacute;s; gracias a ella los brit&aacute;nicos
  pudieron mantener alejados de los submarinos alemanes a los barcos de suministro
  que cruzaban el Atl&aacute;ntico&#133; Turing no recibi&oacute; en vida
  reconocimiento alguno de la sociedad a la que tanto ayud&oacute; en los
  momentos m&aacute;s dif&iacute;ciles.&quot; (Enric Trillas51)</P>
  <P><BR>
  &quot;M&aacute;s sorprendente todav&iacute;a es que Turing demostr&oacute;
  que para cualquier sistema de sus m&aacute;quinas que sea necesario para
  efectuar algoritmos cada vez m&aacute;s complicados existe una m&aacute;quina
  de Turing capaz de hacerlo todo ella sola. Tal m&aacute;quina hipot&eacute;tica
  recibe el nombre de &#145;m&aacute;quina de Turing universal&#146;, y su
  existencia te&oacute;rica pone de manifiesto que el concepto de m&aacute;quina
  de Turing es de una versatilidad sin fin, al permitir que cualquier incremento
  de la complejidad del algoritmo pueda ser aceptado por una lista m&aacute;s
  larga de especificaciones&#133; Los ordenadores actuales son realizaciones
  de las ideas de John von Newmann y de Alan Turing.&quot; (Enric Trillas53)</P>
  <P><BR>
  Turing &quot;en 1950 propuso una prueba que se conoce como el &#145;test
  de Turing&#146;, el cual se basa en la idea siguiente: si una persona se
  comunica s&oacute;lo a trav&eacute;s de un terminal con otras dos partes,
  que est&aacute;n escondidas,, y no se puede discriminar a trav&eacute;s
  de preguntas cu&aacute;l de ambas partes es una persona y cu&aacute;l es
  un ordenador, entonces no se puede negar que la m&aacute;quina muestra
  la cualidad que, en las personas, se llama &#145;inteligencia&#146;. Tal
  procedimiento tiene la ventaja de no tener que definir lo que es la inteligencia.
  Turing cre&iacute;a firmemente que m&aacute;quinas que piensen llegar&iacute;an
  a existir y predijo que hacia el a&ntilde;o 2000 una m&aacute;quina jugar&iacute;a
  al &#145;juego de imitaci&oacute;n&#146;, como &eacute;l llam&oacute; al
  test, de manera que un interrogador medio no tendr&iacute;a m&aacute;s
  del 70 por 100 de posibilidades de efectuar la identificaci&oacute;n correcta
  tras cinco minutos de preguntas.&quot; (Enric Trillas55)</P>
  <P><BR>
  En el desarrollo de la computadora, la teor&iacute;a antecedi&oacute; a
  la pr&aacute;ctica. El manifiesto del nuevo orden electr&oacute;nico de
  cosas fue un trabajo (&quot;On Computable Numbers&quot; -Sobre n&uacute;meros
  calculables-) publicado en 1936, por el matem&aacute;tico y l&oacute;gico
  A.M.Turing, el cual determin&oacute; la naturaleza y las limitaciones te&oacute;ricas
  de las m&aacute;quinas l&oacute;gicas antes de que se construyera siquiera
  una sencilla computadora por completo programable.(Bolter17)<BR>
  Turing... en 1950 public&oacute; &quot;Computing Machinery and Intelligence&quot;...
  expres&oacute; su convicci&oacute;n de que las computadoras eran capaces
  de imitar perfectamente la inteligencia humana y que tal haza&ntilde;a
  la realizar&iacute;an hacia el a&ntilde;o 2000.<BR>
  Al prometer (o al amenazar) sustituir al hombre, la computadora nos ofrece
  una nueva definici&oacute;n de hombre, como &quot;procesador de informaci&oacute;n&quot;,
  y de naturaleza, como &quot;informaci&oacute;n que debe ser procesada&quot;.(Bolter18)<BR>
  <BR>
  &quot;En 1936 Turing concibi&oacute; su propio aut&oacute;mata imaginario.
  La m&aacute;quina de Turing, como se le lleg&oacute; a conocer, no hizo
  intento alguno para unirse a la sociedad de las criaturas vivas. Podr&iacute;a
  visualizarse m&aacute;s como un tocacintas muy sofisticado con una cinta
  arbitrariamente infinita. &quot;Siendo una M&aacute;quina de Estados Finitos,
  se podr&iacute;a concebir como un aut&oacute;mata finito&quot;.(L&eacute;vy
  22-23)</P>
  <P>&nbsp;</P>
  <P><HR ALIGN=LEFT></BLOCKQUOTE>
</BODY>
</HTML>
