<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Hugo A. Gallo">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (Win95; I) [Netscape]">
   <TITLE>origami 2</TITLE>
</HEAD>
<BODY>

<H1>
<A NAME="Origen del Origami"></A><FONT COLOR="#006600">Origen del Origami</FONT></H1>
<B>Periodo Heian</B> (794-1183). Jap&oacute;n cierra sus puertas a los
extranjeros y es as&iacute; que se dedicaron a trabajar con todos los conocimientos
adquiridos, &eacute;poca en la cual se rompe su relaci&oacute;n con China.
En esta &eacute;poca los acontecimientos culturales estaban a cargo de
damas de honor, de gran refinamiento, y las primeras figuras plegadas de
papel se remontan a esa &eacute;poca, no existen indicios que determinen
que dicha inspiraci&oacute;n viniese de China.

<P>Cerca del a&ntilde;o 1000, Murasahi Shikibu, escribi&oacute; "La historia
del Pr&iacute;ncipe Genji", en ella menciona los magn&iacute;ficos tipos
de papel en los que se redactaban las cartas de amor, las poes&iacute;as,
y describ&iacute;a la forma extraordinaria, significativa y delicada en
que eran plegados. Quiz&aacute;s &eacute;sta sea la primera prueba de origami,
ya que en las cartas no s&oacute;lo ten&iacute;a importancia su contenido,
la escritura, la elecci&oacute;n del papel sino tambi&eacute;n la forma
del plegado, ya que era elegido seg&uacute;n la ocasi&oacute;n o de acuerdo
al contenido. Si bien es una descripci&oacute;n mundana, por ser cartas
de amor y felicitaciones, podr&iacute;amos decir que probablemente ten&iacute;an
origen religioso. El ejemplo son las Orikata, trasmitidas de generaci&oacute;n
en generaci&oacute;n, dentro de la clase sacerdotal sinto&iacute;sta.

<P>Los motivos y formas de poner cintas, seg&uacute;n esta t&eacute;cnica
ten&iacute;a significado simb&oacute;lico en ceremonias religiosas y cultos,
un ejemplo la "<B>mariposa</B>" (el plegado tal vez m&aacute;s antiguo),
que a&uacute;n hoy se pliega de much&iacute;simas formas diferentes, estas
eran utilizadas en bodas sinto&iacute;stas, se realizaban una mariposa
macho y una hembra y cerraban 2 botellas de sake, durante la ceremonia
se unificaba el contenido de las 2 botellas en una sola copa, ofreci&eacute;ndoselas
a los novios, como s&iacute;mbolo de amor constante.

<P><B>Periodo Kamakura</B> (1183-1333). Otras figuras plegadas que a&uacute;n
hoy mantienen su significado, fueron los <B>noshis</B>, &eacute;poca de
dominaci&oacute;n militar, motivos religiosos, simbolizando la suerte al
guerrero, ofrecida en templos. Seg&uacute;n el maestro <B>Yoshizawa</B>,
(art&iacute;culo publicado en la revista The origamian",vol.3, 1963), comenta
que hasta el <B>Per&iacute;odo Muromachi </B>(1333-1573) "S&oacute;lo la
nobleza o el muy rico pod&iacute;a tener los medios suficientes para entretenerse
con el Origami".

<P>En el siglo XIV, exist&iacute;an otros plegados que serv&iacute;an de
hor&oacute;scopo, conten&iacute;an plegarias, su forma era en zig-zag,
"Go-Hei", y otros se anudaban, en este caso el "nudo pentagonal".

<P>Al final del per&iacute;odo Muromachi, el origami se hace popular, es
ense&ntilde;ado de generaci&oacute;n en generaci&oacute;n, de madres a
hijos.

<P><A NAME="Noshis"></A><B>Per&iacute;odo Edo </B>(1614-1868). En el siglo
XVIII, donde el Budismo Zen, como religi&oacute;n popular ten&iacute;a
repercusi&oacute;n en la vida espiritual y cultural, &eacute;poca de gran
florecimiento artesanal. Aparecen las escuelas de etiqueta social, ense&ntilde;aban
ceremonia del t&eacute;, ideas&nbsp;<IMG SRC="classes/WebSite/noshis1.jpg" NOSAVE HEIGHT=158 WIDTH=203 ALIGN=LEFT>basadas
en el Zen sobre la postura de flores, Ikebana; poes&iacute;a, realizaci&oacute;n
de cartas, felicitaciones, etc, y la ense&ntilde;anza del plegado art&iacute;stico
para estas escrituras, realizaci&oacute;n de <B><I><U>noshis</U></I></B>.
<DIV ALIGN=right><A HREF="#diagrama de plegados"><IMG SRC="../../ensayosweb/classes/WebSite/up.gif" NOSAVE HEIGHT=32 WIDTH=31></A></DIV>
&nbsp;
<BR>En el a&ntilde;o 1639, Jap&oacute;n cierra nuevamente sus puertas a
occidente hasta 1854, obteniendo gran esplendor art&iacute;stico. Se escribieron
obras para teatro Kabuki, de los ricos y obras populares para teatro de
t&iacute;teres, la obra popular preferida fue "<B>Chushingura</B>", y con
ella aparece la afici&oacute;n de plegar figuras del teatro de t&iacute;teres.
En 1797, las representaciones de origami se dieron con la aparici&oacute;n
del libro <B>"Chushingura orikata</B>", se cree que su autor fue un sacerdote,
eran figuras plegadas para la obra, eran las primeras formas con indicaciones
escritas, en ese mismo a&ntilde;o y el mismo sacerdote, escribe "<B>Sembarazu
Orikata</B>", sobre el plegado de grullas en 1000 formas. Entre 1845 y
1850, aparece la colecci&oacute;n de plegados m&aacute;s importante "<B>Kan
no</B> <B>mado</B>", presumiblemente su autor fuera Adachi Katsuyuki.

<P>Adelant&aacute;ndonos en el tiempo, el pedagogo alem&aacute;n <B>Fr&ouml;bel</B>,
incorpora al origami en sus t&eacute;cnicas de ense&ntilde;anza en los
Kindergartens, esto influy&oacute; en occidente, pedagogo que no deja de
lado a los ge&oacute;metras, que ven en el papel y en sus plegados la posibilidad
de incorporarlos en la ense&ntilde;anza de geometr&iacute;a.

<P>El libro del hind&uacute; <B>Sundara Row</B>, "<B>Geometric excercises
in paper folding</B>", de 1893, se convirti&oacute; en un tratado amplio
de geometr&iacute;a euclidea, esto hace que los matem&aacute;ticos le den
su importancia para la ense&ntilde;anza de la misma, y de esto se conocen
distintos trabajos de distintos autores: Steven Barr, Kodi Husimi, Jacques
Justin ("Pliage et mathematiques"), Arthur Stone, entre otros. Por su parte
Rey Pastor y Unamuno, mencionan la t&eacute;cnica del nudo pentagonal como
aplicable para obtener un pent&aacute;gono.

<P>Sobre los a&ntilde;os 1950-1960, surgen grandes maestros, creando las
nuevas formas de origami moderno, <B>Isao Honda</B>, <B><I><U>Akira Yoshizawa</U></I></B>,
y gran cantidad de aficionados con necesidad de unirse y crear origami.
Los primeros en ver esa necesidad fueron <B>Lillian</B> <B>Oppenheimer</B>,
<B>Dr. Vicente Sol&oacute;rzano</B> <B>Sagredo</B>, (fundador del museo
de origami en Argentina, en 1954, cerrado en 1961), <B><I><U>Ligia Montoya</U></I></B>
(argentina), <B>Adolfo Cerceda </B>(argentino), <B>Vicente Palacios</B>,
<B>Montroll</B>,<B> Nakano</B>, <B>N. Elias</B> y muchos otros, que al
dar mayor importancia al plegado, dan a sus figuras la posibilidad de ser
estudiadas e interpretadas, siempre sin importar el tama&ntilde;o, pero
con igual perfecci&oacute;n.

<P>El <B>Dr Starr</B>, profesor en la universidad de Chicago, residi&oacute;
en Jap&oacute;n durante la primera guerra mundial, conoce el origami y
busca publicaciones del mismo, seg&uacute;n cuentan, encontr&oacute; una
casa de art&iacute;culos antiguos y en ella un manuscrito perteneciente
a un volumen de una gran enciclopedia, de el sac&oacute; copias, su original
en Jap&oacute;n no fue encontrado, y la copia de Starr fue encontrada en
1960, esta publicaci&oacute;n fue interpretada y comentada por <B>Julia
y Martin Brossman</B>.

<P>Los modelos del <B>Kan no mado</B>, son realmente interesantes, mariposas
macho y hembra, diversos noshis plegados, la lib&eacute;lula, la rana (regreso
de amor y &eacute;xito en la profesi&oacute;n) y el mono, pero contiene
principalmente figuras humanas, el payaso bailando, el luchador en la arena,
indicaciones de plegado para mu&ntilde;ecos, el emperador, la emperatriz,
damas de honor, y otros. Este manuscrito pudr&iacute;a haber estado realizado
para las fiestas de las muchachas, festividad de mu&ntilde;ecos (realizadas
el 3 de marzo), ceremonia de purificaci&oacute;n, donde todas las impurezas
eran transmitidas a los mu&ntilde;ecos de papel y luego arrojadas al r&iacute;o.
Tambi&eacute;n para la festividad de los muchachos (5 de mayo), donde lanzan
cometas al aire, carpas de papel (simbolizando la tenacidad, perseverancia,
dignidad, larga vida), fiesta de la flor del cerezo (de amor y del guerrero),
del ciruelo (para la justicia, esperanza), del aprendiz, flor de loto (pureza),
la Grulla (ave imperial, s&iacute;mbolo de 1000 a&ntilde;os de vida), la
tortuga (alegor&iacute;a, longevidad, 10000 a&ntilde;os de vida), entre
otros.

<P>De siempre la humanidad ha sido provista de mucho material que ellos
doblaban en formas est&eacute;ticas, ejemplo de esto: trenzado de junco,
las vestimentas Griegas antiguas, y el pliegue de servilletas en Europa
incluye formas que m&aacute;s tarde ser&aacute;n designadas "<I><U><A HREF="origami4.htm#Aprendiendo las Bases">bases</A></U>"</I>
y todav&iacute;a en papel no eran conocidas. Los ejemplos cl&aacute;sicos
son el zig-zag, dobleces planos, blintz y bombas de agua. Referencia de
ellas fue hecha en el libro de Mattia Giegher, "Tratatto delle Pliegatture",
Padua 1639, donde son mostradas esas bases para el comienzo de como doblar
servilletas.

<P>Seg&uacute;n Robert Harbin en su libro "Papel M&aacute;gico, el Arte
de plegar papel" (Paper Magic, the Art of Paper-folding), Londres 1965
(7ta Edici&oacute;n), entre 1704 y 1739, aparece libros de instrucciones
pero, sin duda, el documento mayor fue la aparici&oacute;n del libro de
instrucciones del a&ntilde;o 1797, donde es mencionado una generalidad
de bases plegadas.

<P>En 1853, son conocidas en Europa como base p&aacute;jaro y la base rana.
La primera publicaci&oacute;n que reconoce esto, fue la revista Inglesa
"The Boys Own Paper", Vol. VIII, 1886, donde son publicadas las instrucciones
preliminares. Pero, como en 1952, empez&oacute; a aparecer la representaci&oacute;n
gr&aacute;fica, diferenciando dobleces en valle y en monta&ntilde;a que
ide&oacute; Yoshizawa; al mismo tiempo, Randlett y Harbin, analizaron el
doblado y empezaron a designarlas y a diferenciarlas. Reci&eacute;n entonces,
empieza la idea de "bases" como principio para la ejecuci&oacute;n de dobleces
y el comienzo de la necesidad de unificar ideas en los distintos nombres
de dichos pliegues: de valle, monta&ntilde;a, escal&oacute;n, oreja de
conejo, crushed, p&eacute;talo y sink ; cometa, bomba de agua, preliminar,
ave y rana.
<DIV ALIGN=right><A HREF="#diagrama de plegados"><IMG SRC="../../ensayosweb/classes/WebSite/up.gif" NOSAVE HEIGHT=32 WIDTH=31></A></DIV>

<DIV ALIGN=right><I><A HREF="origami1.htm#Origami 1 Top Page">Volver a
la p&aacute;gina principal</A></I></DIV>

</BODY>
</HTML>
