<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Hugo A. Gallo">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (Win95; I) [Netscape]">
   <TITLE>origami 3</TITLE>
</HEAD>
<BODY>

<H1>
<A NAME="El plegado y el origen..."></A><FONT COLOR="#006600">El plegado
y el origen de sus s&iacute;mbolos</FONT></H1>
<B>V&iacute;spera de A&ntilde;o Nuevo</B>. El d&iacute;a antes de A&ntilde;o
Nuevo es un d&iacute;a de purificaci&oacute;n. El A&ntilde;o Nuevo. Originalmente
una fiesta China. La gente va a lugares sagrados y templos donde ellos
pueden comprar un papel de la fortuna, prediciendo buena suerte o aconsejando
como para evitar la mala suerte. Papeles sagrados mantenidos en la casa
para absorber mala suerte y enfermedad. Muchas tradiciones dentro de un
modo sagrado, religioso. (Traditions of the World Series, San Francisco,
Harper &amp; Publishers, 1984)

<P>Alrededor del 15 de Enero. A&ntilde;o nuevo peque&ntilde;o, la primera
luna completa de un a&ntilde;o nuevo. En algunas &aacute;reas, viejo lugar
sagrado y los papeles del templo est&aacute;n quemados en una hoguera en
esta noche celebrando el kami de arroz y el a&ntilde;o nuevo.

<P>3 de Marzo. La Fiesta de la Mu&ntilde;eca. Originalmente una fiesta
China. En &eacute;pocas previas, mu&ntilde;ecos de papel eran usados para
quitar impurezas en la gente. Hoy es en gran parte un d&iacute;a de fiesta
para muchachas quienes crean representaciones visual de mu&ntilde;ecas.

<P>5 de Mayo. "Kodomo-No-Hi" o D&iacute;a de los muchachos. Originalmente
una fiesta China; posiblemente primero utilizado para alejar a los esp&iacute;ritus
malignos fuera de la casa con la colocaci&oacute;n de mu&ntilde;ecos en
el exterior de la casa, a los que vistieron como soldados Ahora, durante
este d&iacute;a, es la representaci&oacute;n de guerreros en miniatura,
y en lugares familiares el uso de serpentinas de tela o papel afuera de
sus casas, un por cada hijo. El tama&ntilde;o de las serpentinas seg&uacute;n
la edad de los muchachos y de simboliza fortaleza.

<P>30 de Junio. La Gran purificaci&oacute;n. Ceremonia ejecutada en locales
sagrados (Shinto) para destruir las impurezas que la gente ha adquirido
desde el D&iacute;a de A&ntilde;o Nuevo. Algunos frotan una mu&ntilde;eca
de papel contra ellos mismos para que recoja sus impurezas. Los mu&ntilde;ecos
quedan en el lugar sagrado dispuesto por los sacerdotes.

<P>7 de Julio/ 6-8 de Agosto. Tanabata Matsuri. Originalmente una fiesta
China. La fiesta de honor de los amantes quienes se ha reunido en este
d&iacute;a. Enormes serpentinas imitan a las estrellas de la V&iacute;a
L&aacute;ctea donde ellos vivieron. Mu&ntilde;ecos de papel, fajas de oraci&oacute;n,
o papeles coloreados con poemas est&aacute;n colocados en ramas de bamb&uacute;
frente a las casas. Ellos simbolizan oraciones para en &eacute;xito en
tejedur&iacute;a (tanabata), escritura, y artesan&iacute;a. Los padres
tambi&eacute;n atan una muestra de la escritura de sus ni&ntilde;os en
las ramas. Despu&eacute;s de la fiesta, las ramas flotan en un r&iacute;o
para que sus oraciones sean contestadas, y la escritura de los ni&ntilde;os
mejorada. (Ed. de libros del Time Life, El a&ntilde;o m&iacute;stico, 1992)

<P>25 de Julio. Osaka fiesta. Unos 1000 a&ntilde;os atr&aacute;s, la gente
hac&iacute;a mu&ntilde;ecos de papel y los frotaba en sus cuerpos para
sacar enfermedades o esp&iacute;ritus de maldad.

<P>6 de Agosto. En Hiroshima actualmente, "obun odori" o linternas de papel
que flotan en los r&iacute;os, lagunas, lagos, conmemorando el d&iacute;a
en que la bomba at&oacute;mica caus&oacute; 75.000 v&iacute;ctimas.

<P>9 de Agosto. Cerca de Nagasaki, las escuelas de ni&ntilde;os crean guirnaldas
de grullas para conmemorar el d&iacute;a que la bomba at&oacute;mica caus&oacute;
40.000 v&iacute;ctimas.

<P>Fiesta de "Sukushi" o papel reciclado, era papel que hab&iacute;a sido
desentintando. Tambi&eacute;n incluido "kankonshi", (papel recordando a
un alma perdida). Esto es papel reciclado de cartas de un difunto, y reciclado
para uso diario. (Todo Jap&oacute;n hecho a mano Washi Asociation, Un Manual
del Arte de Washi.).
<DIV ALIGN=right><A HREF="#diagrama de plegados"><IMG SRC="../../ensayosweb/classes/WebSite/up.gif" NOSAVE HEIGHT=32 WIDTH=31></A></DIV>

<DIV ALIGN=right><I><A HREF="origami1.htm#Origami 1 Top Page">Volver a
la p&aacute;gina principal</A></I></DIV>

</BODY>
</HTML>
