<HTML>
<HEAD>
 <TITLE>Cuadriláteros... V.Larios y N.González</TITLE>
</HEAD>

<BODY background=tfondo.gif>

<center>
<table width=60% border=1><tr><td align=center>
<font size=4>Regresar a: <a href='index.html'><b><i>Doblando la Geometría</i></b></a></font>
</td></tr></table>

<p>&nbsp;</p>

<table width=90% bgcolor=#9fb9e0><tr><td align=center>
<h2>Ejercicios con doblado de papel para el estudio de los cuadriláteros en la escuela secundaria</h2>
<h3>Extracto de la tesis:</h3>
<h1>Uso de la microcomputadora y del doblado de papel en la aplicación del modelo de van Hiele en la enseñanza de la Geometría Euclidiana en el nivel medio básico</h1>
<h3>que presentaron</h3>
<h2>Noraísa González González<br>y<br>Víctor Larios Osorio</h2>
<h3>para obtener el título de<br>
Licenciados en Educación Media con especialidad en Matemáticas<br>
en la<br>
Centenaria y Benemérita Escuela Normal del Estado de Querétaro "Andrés Bavanera"</h3>
<h3><font size=-1>Querétaro, Qro. 1994</font></h3>
</td></tr></table></center>

<font face='Verdana,Arial,Helvetica,sans-serif' size=2>
<p>&nbsp;</p>

<center><table width=80% border=1 bgcolor=yellow><tr><td align=center>
<font color=blue><h2>Nota introductoria</h2></font>
</td></tr></table></center>

<p align=justify>El contenido de esta página web es un extracto de nuestra tesis de licenciatura que tiene como objetivo presentar ejercicios de doblado de papel que, bajo un marco teórico específico, fueron utilizados para el estudio de los cuadriláteros en la escuela secundaria mexicana. De lo anterior se desprende que no se incluye toda la tesis y, ni siquiera, todo el marco teórico; lo que se incluye antes de las actividades que se realizaron sólo es una introducción que buscan ubicar al lector en un contexto determinado.</p>

<center><table width=80% border=1 bgcolor=yellow><tr><td align=center>
<font color=blue><h2>Propiedades de los cuadril&aacute;teros</h2></font>
</td></tr></table></center>

<P ALIGN="JUSTIFY">El curso del experimento involucra de manera directa las propiedades que poseen un tipo de figuras geom&eacute;tricas denominadas cuadril&aacute;teros, por lo que presentamos las caracter&iacute;sticas de &eacute;stos, utilizando las que se sirvieron para alimentar a las microcomputadoras en los actividades programadas.</P>
<P ALIGN="JUSTIFY">Lo inicial es la presentaci&oacute;n de las propiedades de todos los cuadril&aacute;teros:</P>
<P ALIGN="JUSTIFY">Los cuadril&aacute;teros son pol&iacute;gonos, figuras geom&eacute;tricas formadas de l&iacute;neas rectas que encierran una porci&oacute;n finita de plano, cuya &uacute;nica caracter&iacute;stica es:</P>
<b><ol type=a>
 <li>Tienen cuatro lados.
</ol></b>
<P ALIGN="JUSTIFY">A partir de aqu&iacute;, los cuadril&aacute;teros se dividen en tres grandes grupos: los paralelogramos, los trapecios y los trapezoides. Nos ocuparemos primeramente de los paralelogramos.</P>
<P ALIGN="JUSTIFY">Los paralelogramos son un tipo de cuadril&aacute;teros que tienen como caracter&iacute;sticas:</P>
<b><ol type=a>
 <li>Tienen cuatro lados.
 <li>Dos lados opuestos son paralelos.
 <li>Los otros dos lados son paralelos entre s&iacute; tambi&eacute;n.
</ol></b>
<P ALIGN="JUSTIFY">Dentro de los cuadril&aacute;teros, y por las mismas caracter&iacute;sticas que &eacute;stas figuras poseen, podemos distinguir a los rect&aacute;ngulos, los rombos y el cuadrado.</P>
<P ALIGN="JUSTIFY">Los rect&aacute;ngulos son paralelogramos que, aparte de cumplir con las propiedades de &eacute;stos &uacute;ltimos, tienen las caracter&iacute;sticas de que:</P>
<B><ol type=a>
 <li>Sus lados opuestos son iguales entre s&iacute;.
 <li>Sus cuatro &aacute;ngulos interiores son iguales.
</ol>
</B><P ALIGN="JUSTIFY">Los rombos, al ser paralelogramos tambi&eacute;n, cumplen con las propiedades de &eacute;stos y tienen las siguientes caracter&iacute;sticas:</P>
<B><ol type=a>
 <li>Sus &aacute;ngulos internos opuestos son iguales entre s&iacute;.
 <li>Sus cuatro lados son iguales.
</ol>
</B><P ALIGN="JUSTIFY">El tercer tipo de paralelogramo, el cuadrado, cumple con las propiedades de los paralelogramos, los rect&aacute;ngulos y los rombos, por lo que puede ser considerado como un caso en particular de &eacute;stos &uacute;ltimos y sus caracter&iacute;sticas son una combinaci&oacute;n de las caracter&iacute;sticas de dichas figuras, las cuales son:</P>
<B><ol type=a>
 <li>cuatro &aacute;ngulos interiores son iguales.
 <li>Sus cuatro lados son iguales.
</ol>
</B><P ALIGN="JUSTIFY">El otro gran grupo de cuadril&aacute;teros, o "familia", es el de los trapecios. Los trapecios son cuadril&aacute;teros que tienen las siguientes caracter&iacute;sticas: </P>
<B><ol type=a>
 <li>Tienen cuatro lados.
 <li>Dos lados son paralelos entre s&iacute;.
 <li>Los otros dos lados NO son paralelos entre s&iacute;.
</ol>
</B><P ALIGN="JUSTIFY">Dentro de los trapecios existen los trapecios is&oacute;sceles, los trapecios escalenos y los trapecios rect&aacute;ngulos.</P>
<P ALIGN="JUSTIFY">Los trapecios is&oacute;sceles cumplen con las caracter&iacute;sticas de los trapecios y, adem&aacute;s, con la caracter&iacute;stica siguiente: </P>
<B><ol type=a>
 <li>Los lados no paralelos son iguales entre s&iacute;.
 <li>Los &aacute;ngulos interiores situados en los extremos de cada uno de los lados paralelos son iguales entre s&iacute;.
</ol>
</B><P ALIGN="JUSTIFY">Los trapecios escalenos cumplen, por ser trapecios, con las caracter&iacute;sticas del trapecio, adem&aacute;s de que tienen la siguiente condici&oacute;n:</P>
<B><ol type=a>
 <li>Los lados no paralelos NO son iguales entre s&iacute;.
 <li>Los &aacute;ngulos interiores situados en los extremos de cada uno de los lados paralelos NO son iguales entre s&iacute;.
</ol>
</B><P ALIGN="JUSTIFY">Finalmente, los trapecios rect&aacute;ngulos forman un subconjunto dentro de los trapecios escalenos, por lo que cumplen con las caracter&iacute;sticas de &eacute;stos y, tambi&eacute;n, con las caracter&iacute;sticas:</P>
<B><ol type=a>
 <li>Un lado de los no paralelos es perpendicular a los lados paralelos.
 <li>Los &aacute;ngulos situados en los extremos de dicho lado perpendicular son iguales entre s&iacute; y rectos.
</ol>
</B><P ALIGN="JUSTIFY">Con estas caracter&iacute;sticas se manejaron los cuadril&aacute;teros durante el desarrollo del experimento.</P>

<center><table width=80% border=1 bgcolor=yellow><tr><td align=center>
<font color=blue><h2>Descripción del modelo de van Hiele</h2></font>
</td></tr></table></center>

<P ALIGN="JUSTIFY">Comenzaremos por exponer lo que es el modelo de Van Hiele para la ense&ntilde;anza de la geometr&iacute;a, observando que el t&eacute;rmino <I>geometr&iacute;a</I> se refiere a la geometr&iacute;a euclidiana exclusivamente.</P>
<P ALIGN="JUSTIFY">El modelo de Van Hiele es un modelo de ense&ntilde;anza que marca la pauta a seguir en la ense&ntilde;anza de la geometr&iacute;a. Tuvo su origen en Holanda, donde los Van Hiele, profesores de matem&aacute;ticas, se encontraron con problemas para poder hacer entender a sus alumnos las definiciones, los procesos y las situaciones relacionadas casi exclusivamente con la ense&ntilde;anza de la geometr&iacute;a, ya que su aplicaci&oacute;n en otras ramas de las matem&aacute;ticas no ha sido tan eficiente.</P>
<P ALIGN="JUSTIFY">El modelo consta principalmente de dos partes. La primera es descriptiva y se refiere a lo que Van Hiele define como "niveles de razonamiento"; la segunda, da las directrices para el desarrollo docente en lo que llama "fases de aprendizaje".</P>
<P ALIGN="JUSTIFY">Los niveles de razonamiento son definidos como los estadios del desarrollo de las capacidades intelectuales del estudiante, los cuales no est&aacute;n directamente ligados con el crecimiento o la edad. Aunque este hecho hace que Van Hiele y Piaget difieran, la mayor parte de lo que se refiere a la adquisici&oacute;n del conocimiento y el desarrollo intelectual del estudiante concuerda entre ambos te&oacute;ricos. Estos niveles de razonamiento se repasan sucesivamente en cada ocasi&oacute;n en que el estudiante se encuentra con un nuevo tema a tratar en matem&aacute;ticas, pero los primeros son pasados de una manera m&aacute;s r&aacute;pida que en ocasiones anteriores. Los niveles de razonamiento que plantea el modelo son:</P>
<ol>
 <li><B>Reconocimiento.</B> En este nivel el estudiante percibe los elementos a estudiar en su totalidad, de manera global, como unidades e individuales, limit&aacute;ndose a descripciones y reconocimientos f&iacute;sicos exteriores.
 <li><B>An&aacute;lisis.</B> Se establece que los elementos a estudiar est&aacute;n formados por partes con propiedades, se pueden generalizar otras propiedades a partir de ejemplos, pero no es posible hacer clasificaciones l&oacute;gicas por no relacionar unas propiedades con otras.
 <li><B>Clasificaci&oacute;n.</B> En este nivel el estudiante es capaz de dar definiciones formales de los objetos a estudiar, de establecer relaciones entre propiedades y deducir algunas de otras, pero no puede establecer la concatenaci&oacute;n de razonamientos que pueden llevar a una demostraci&oacute;n. El estudiante a&uacute;n no es capaz de comprender la estructura axiom&aacute;tica de las matem&aacute;ticas.
 <li><B>Deducci&oacute;n formal.</B> En donde el estudiante es capaz de llevar a cabo razonamientos l&oacute;gicos formales y comprender la estructura axiom&aacute;tica de las matem&aacute;ticas, esto al tiempo de encontrarle sentido y utilidad a las demostraciones de teoremas. Asimismo, puede llegar al mismo resultado por distintos caminos, es decir, por medios equivalentes.
</ol>
<P ALIGN="JUSTIFY">Vale la pena puntualizar que existen caracter&iacute;sticas que tienen todos los niveles, pero que en cada uno de &eacute;stos se manifiesta de distintas maneras. En t&eacute;rminos generales estas caracter&iacute;sticas son: la jerarquizaci&oacute;n y secuencialidad de los niveles, la relaci&oacute;n entre el lenguaje y los niveles y, la continuidad del paso por los niveles.</P>
<P ALIGN="JUSTIFY">La jerarquizaci&oacute;n y secuencialidad de los niveles se refiere a la necesidad de transitar primero un nivel para, posteriormente, pasar al siguiente superior de tal manera que es obligatorio cursar todos sin omitir ninguno. Esto tiene la ventaja del elemento denominado recursividad, pues los conceptos y definiciones a los que un estudiante o educando en desarrollo tiene acceso en un determinado nivel los utilizar&aacute; posteriormente en los siguientes.</P>
<P ALIGN="JUSTIFY">La relaci&oacute;n entre el lenguaje y los niveles se relaciona con el mismo desarrollo del estudiante y la manera en que se comunica con los dem&aacute;s, ya sea con el profesor o con sus compa&ntilde;eros. Se dice que "a cada nivel de razonamiento le corresponde un lenguaje espec&iacute;fico", con lo que se quiere dar a entender que dos personas que cuyo nivel de razonamiento difieren dif&iacute;cilmente se comprender&aacute;n al platicar sobre el tema. Es necesario que el profesor presente a los alumnos o educandos las situaciones o el conocimiento con un lenguaje accesible y de acuerdo con su nivel de razonamiento. Por &uacute;ltimo, la continuidad del paso por los niveles. Esto implica que, en ocasiones, los educandos podr&aacute;n presentar rasgos en sus procedimientos y razonamientos que corresponden a un estado de transici&oacute;n entre dos niveles. Como mencionan Jaime y Guti&eacute;rrez: "La evidencia de este per&iacute;odo [el de transici&oacute;n] ser&aacute; que el estudiante mostrar&aacute; deseos de usar el nivel superior, pero cuando encuentre dificultades o dudas tender&aacute; a refugiarse en la seguridad del nivel inferior, en el que se siente m&aacute;s c&oacute;modo".</P>
<P ALIGN="JUSTIFY">Es de capital importancia que cualquier profesor que tome a su cargo y direcci&oacute;n un grupo de geometr&iacute;a establezca el nivel en el que se encuentran sus alumnos. Esto se lograr&aacute; por medio de procedimientos evaluativos en los que se deben evitar respuestas sencillas y que impliquen memorismos, ya que se tienen que mostrar los procedimientos de razonamiento que llev&oacute; a cabo el estudiante en el momento de resolver la cuesti&oacute;n. Esto se debe a la necesidad de saber el nivel de razonamiento del estudiantado, y no su nivel de conocimiento, no observando "si los estudiantes contestan bien o mal, sino c&oacute;mo contestan y por qu&eacute; lo hacen as&iacute;".</P>
<P ALIGN="JUSTIFY">La segunda parte del modelo, y que se refiere a las directrices que se dan a los profesores, son las llamadas fases de aprendizaje. Estas fases de aprendizaje son los per&iacute;odos por los que se tienen que pasar en cada uno de los niveles para alcanzar el siguiente. En general son cinco, y son:</P>
<ol>
 <li><B>Informaci&oacute;n.</B> Que se refiere a informar a los estudiantes del tema que se estudiar&aacute;.
 <li><B>Orientaci&oacute;n dirigida.</B> Que se refiere a la investigaci&oacute;n, b&uacute;squeda, etc&eacute;tera, de conocimientos principalmente por parte de los alumnos. En esta fase se construye la red mental que permitir&aacute; relacionar los conocimientos posteriormente.
 <li><B>Explicitaci&oacute;n.</B> Que se refiere a la presentaci&oacute;n y comparaci&oacute;n de datos y conocimientos obtenidos entre el grupo. En este punto es importante que existan puntos de vista diferentes, y quiz&aacute; divergentes, dentro del alumnado, ya que esto dar&aacute; una mayor riqueza al mismo grupo y, al mismo tiempo, har&aacute; que el estudiante analice sus ideas, las ordene y las exprese con claridad.
 <li><B>Orientaci&oacute;n libre.</B> Que se refiere principalmente a la aplicaci&oacute;n de los conocimientos adquiridos en las fases anteriores y su interrelaci&oacute;n y aplicaci&oacute;n junto con otros conocimientos ya adquiridos.
 <li><B>Integraci&oacute;n.</B> Esta fase se refiere a la acumulaci&oacute;n, integraci&oacute;n y comparaci&oacute;n de conocimientos que se han adquirido, tratando de tomar conciencia en el uso de elementos impl&iacute;citos de &eacute;stos.
</ol>
<P ALIGN="JUSTIFY">De esta manera cada nivel de razonamiento queda estructurado en cinco fases de aprendizaje. Si quisi&eacute;ramos hacer una analog&iacute;a podr&iacute;amos decir que el modelo puede ser representado por una escalera de caracol que diera cuatro vueltas sobre su eje (cada vuelta es un nivel) y en cada vuelta de la escalera se tendr&iacute;an cinco escalones (uno por cada fase de aprendizaje). De esta manera, al alcanzar el nivel mayor podr&iacute;amos decir que hemos llegado a la parte superior de la escalera. </P>
<P ALIGN="JUSTIFY">Pero hasta este punto, ¿c&oacute;mo va a generar estos conocimientos el alumno?</P>
<P ALIGN="JUSTIFY">Desde esta postura, el alumno construir&aacute; el conocimiento a partir de "redes de relaciones", en el proceso de construirlas y modificarlas sucesivamente seg&uacute;n el nivel de razonamiento en el que se encuentre.</P>
<P ALIGN="JUSTIFY">As&iacute;, y de esta manera, tenemos que el aprendizaje lo caracterizamos por ser un proceso personal del individuo en el que inciden factores tanto internos como externos. "Es hacer m&aacute;s significativo el papel del sujeto en situaci&oacute;n de habla, en la soluci&oacute;n de problemas y en la realizaci&oacute;n de actividades para asumir cr&iacute;ticamente y transformar sus relaciones de conocimiento con el entorno; es desarrollar el discurso explicativo y argumentativo de las actividades sapientes, las expectativas y la voluntad de apropiaci&oacute;n de nuevos conocimientos". Pero se remarca mucho que el aprendizaje debe ser personal, es decir, otra persona no lo har&aacute; por nosotros y el profesor &uacute;nicamente se dedica a guiar y coordinar. Y, ¿c&oacute;mo se lleva a cabo este proceso? Paulo Freire contesta simplemente: "oyendo, preguntando, investigando".</P>
<P ALIGN="JUSTIFY">En este modelo el profesor cambia el papel de expositor que com&uacute;nmente se le atribuye y toma un papel de coordinador de los trabajos. No se prepara para exponer clase y hacer ex&aacute;menes, sino que busca los ejercicios y actividades necesarios para crearle un ambiente al alumno propicio para el desarrollo de su razonamiento y su tr&aacute;nsito por los diferentes niveles de razonamiento. Van Hiele lo expone de la siguiente manera: "El objetivo del arte de ense&ntilde;ar es precisamente enfrentarse a la cuesti&oacute;n de saber c&oacute;mo se pasa a trav&eacute;s de esas fases [del aprendizaje] y c&oacute;mo se puede prestar ayuda al estudiante de forma eficaz". Y para que el docente alcance este objetivo se sirve de las experiencias controladas dentro del aula de clases, es decir, de la llamada educaci&oacute;n matem&aacute;tica. Y as&iacute;, mientras que el profesor cambia el papel de expositor a coordinador, el papel del alumno cambia de receptor pasivo de la informaci&oacute;n a buscador activo de la misma. Este cambio en los papeles implicar&aacute; la necesidad de que el profesor conozca y maneje el material y el modelo para poderlo llevar a cabo sin mayores tropiezos, ayudando al estudiante en la b&uacute;squeda y construcci&oacute;n de su propio conocimiento.</P>

<center><table width=80% border=1 bgcolor=yellow><tr><td align=center>
<font color=blue><h2>Descripción del proceso del experimento</h2></font>
</td></tr></table></center>

<P ALIGN="JUSTIFY">Las actividades de origami eran una serie de 22 actividades en las que se utilizaron t&eacute;cnicas de doblado y rasgado de papel, todas clasificadas y ordenadas de acuerdo a cada figura a ver y de acuerdo a los niveles de razonamiento de Van Hiele, pretendiendo que el alumno vaya aumentando su nivel de razonamiento en cada figura. No pod&iacute;amos aspirar a que los alumnos alcanzaran un nivel de razonamiento IV, porque desafortunadamente la falta de tiempo y las circunstancias socioculturales no lo permiten.</P>
<P ALIGN="JUSTIFY">Estas 22 actividades que se desarrollaron est&aacute;n clasificadas seg&uacute;n la figura de la siguiente manera:</P>
<P ALIGN="JUSTIFY">Cuatro actividades para el rect&aacute;ngulo, comprendiendo actividades que corresponden desde el nivel I de razonamiento hasta el nivel III. Estas actividades fueron: construcci&oacute;n de un rect&aacute;ngulo (nivel I), nombramiento de los puntos donde se unen los lados (nivel II), identificaci&oacute;n de las partes de un rect&aacute;ngulo (nivel II) y comprobaci&oacute;n de las propiedades de un rect&aacute;ngulo (nivel III).</P>
<P ALIGN="JUSTIFY">Cuatro actividades para el rombo, con una correspondencia entre los niveles del I al III, las cuales fueron: construcci&oacute;n de un rombo mediante dos m&eacute;todos (nivel I ambas), relaci&oacute;n existente entre los rombos y los rect&aacute;ngulos (nivel II) y comprobaci&oacute;n de las propiedades de los rombos (nivel III).</P>
<P ALIGN="JUSTIFY">Cinco actividades para el cuadrado, tambi&eacute;n con la intenci&oacute;n de alcanzar un nivel III. Dichas actividades fueron: construcci&oacute;n de un cuadrado (nivel I), determinaci&oacute;n de las partes de un cuadrado (nivel II), comprobaci&oacute;n de que el cuadrado es un caso particular de los rect&aacute;ngulos (nivel III), comprobaci&oacute;n de que el cuadrado es un caso particular de los rombos (nivel III) y comprobaci&oacute;n de las caracter&iacute;sticas generales de los cuadrados (nivel III).</P>
<P ALIGN="JUSTIFY">Ocho actividades para los trapecios y todas sus clasificaciones, actividades que corresponden desde el nivel I hasta el nivel III. Dichas actividades fueron: Construcci&oacute;n de un trapecio (nivel I), las partes de un trapecio (nivel II), construcci&oacute;n de un trapecio escaleno (nivel I), propiedades de los trapecios escalenos (nivel III), construcci&oacute;n de un trapecio is&oacute;sceles (nivel I), propiedades del trapecio is&oacute;sceles (nivel III), construcci&oacute;n de un trapecio rect&aacute;ngulo (nivel I) y propiedades del trapecio rect&aacute;ngulo (nivel III).</P>
<P ALIGN="JUSTIFY">Una actividad que involucra a los trapezoides y que corresponde al nivel I de razonamiento, la cual fue la obtenci&oacute;n de trapezoides a partir de un cuadrado de papel (nivel I).</P>
<P ALIGN="JUSTIFY">Todas estas actividades fueron clasificadas, como ya se mencion&oacute;, tomando en cuenta la complejidad de los dobleces y la complejidad de los conceptos utilizados en cada una de ellas para colocarlas en un orden de acuerdo con el nivel de razonamiento y la fase de aprendizaje, para pasar a su transcripci&oacute;n en las secuencias did&aacute;cticas que m&aacute;s adelante describiremos (secci&oacute;n III.2.2).</P>

<center><table width=80% border=1 bgcolor=yellow><tr><td align=center>
<font color=blue><h2>El doblado de papel</h2></font>
</td></tr></table></center>

<P ALIGN="JUSTIFY">El apoyo del doblado de papel fue destinado a las actividades del experimento, para lo cual fueron recopiladas, elaboradas y clasificadas un total de 22 actividades que fueron las que constituyeron el proceso del experimento. Estas actividades fueron tomadas en cuenta utilizando una lista de postulados a fin de para mantener un cierto rigor que nos permita continuar sobre una l&iacute;nea l&oacute;gico-deductiva aceptable y que pasamos a considerar a continuaci&oacute;n:</P>
<ol>
 <li>Puede considerarse que una hoja de papel es una superficie plana.
 <li>Un pliegue realizado en una hoja de papel que pase por dos puntos del papel y que se ha hecho sobre una superficie plana como soporte es una l&iacute;nea recta.
 <li>El papel puede ser plegado de tal manera que pase por dos o m&aacute;s puntos colineales.
 <li>Pueden superponerse dos puntos distintos en una misma hoja de papel.
 <li>Puede plegarse el papel de modo que un punto puede superponerse a otro pliegue.
 <li>Puede plegarse el papel de modo que dos pliegues de una misma hoja pueden superponerse.
 <li>Dos &aacute;ngulos son congruentes si al superponerse coinciden.
 <li>Dos segmentos son congruentes si al superponerse coinciden.
</ol>
<P ALIGN="JUSTIFY">Considerando los postulados las 22 actividades fueron clasificadas inicialmente de acuerdo a la figura geom&eacute;trica a la que se refer&iacute;an para ser posteriormente clasificadas de acuerdo al nivel de razonamiento y a la fase de aprendizaje que les correspond&iacute;a.</P>
<P ALIGN="JUSTIFY">De esta manera obtuvimos cuatro actividades para los rect&aacute;ngulos, cuatro para los rombos, cinco para los cuadrados, seis para los trapecios y una actividad para los trapezoides. Actividades que fueron ordenadas en las secuencias did&aacute;cticas que en las p&aacute;ginas siguientes se presentan.</P>

<h3>FIGURA: RECTANGULO</h3>

<TABLE BORDER WIDTH=100% x=671>
<TR>
<td colspan=5><FONT FACE="Arial Narrow" SIZE=2><P><b>Nombre de la Actividad</b></FONT></TD>
</tr>
<tr>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Nivel</b></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Fase</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>CONSIGNA</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>PLAN DE TRABAJO</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>OBSERVACIONES</b></FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>1 Construcci&oacute;n de un rect&aacute;ngulo</FONT>
 </TD><td width=50% align=right>
 <img src='e01.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un trozo de papel irregular.<br>
2.- D&oacute;blenlo y c&oacute;rtenle un lado.<br>
3.- D&oacute;blenle otro lado de tal forma que quede haciendo &aacute;ngulo recto con el primero, quedando otro lado.<br>
4.- Escojan uno de los lados existentes y doblen perpendicularmente para que quede un tercer lado.<br>
5.- Formen el cuarto lado de igual manera que los tres lados anteriores.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Se formar&aacute;n equipos de tres integrantes.<br>
2.- Elaborar&aacute;n cada uno un rect&aacute;ngulo.<br>
3.- En equipo comparar&aacute;n las figuras resultantes, estableciendo los parecidos y las diferencias.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno identifique el rect&aacute;ngulo a trav&eacute;s de la orientaci&oacute;n dirigida y comparta sus experiencias con sus compa&ntilde;eros.</FONT></TD>
</TR>
<TR>
<TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>2  Nombrar los puntos donde unen dos lados de un rect&aacute;ngulo</FONT></TD></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">1</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo e identifiquen sus cuatro esquinas. En cada esquina se encuentran dos lados que se tocan en ese mismo punto.</br>
2.- Denle un nombre a ese punto.<br>
3.- Ahora encuentra el punto de estos de arriba a la izquierda y ponle &quot;A&quot;.<br>
4.- Enseguida y en el mismo sentido que las manecillas del reloj localiza el siguiente punto y ll&aacute;male &quot;B&quot;.<br>
5.- Contin&uacute;a con la misma secuencia y llama &quot;C&quot; y &quot;D&quot; a los siguientes puntos.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Sentados alrededor del sal&oacute;n identificar&aacute;n lo v&eacute;rtices, de manera individual y con orientaci&oacute;n dirigida.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende generalizar la idea de identificaci&oacute;n de v&eacute;rtices.</P>
<P ALIGN="JUSTIFY">Se necesitar&aacute;n rect&aacute;ngulos de diversas dimensiones.</FONT></TD>
</TR>
<tr>
<td colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>3 Identificaci&oacute;n de las partes de un rect&aacute;ngulo.</FONT>
 </TD><td width=50% align=right>
 <img src='e02.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Doblen un rect&aacute;ngulo a trav&eacute;s de dos esquinas (no importa si las otras dos esquinas no coinciden).<br>
2.- P&oacute;nganle nombre al doblez que resulta (diagonal).<br>
3.- Con el mismo procedimiento del paso 1, pero con las otras esquinas, encuentra la otra diagonal.<br>
4.- Nombren el punto donde se cruzan las diagonales.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Sentados alrededor del sal&oacute;n por parejas realizar&aacute;n de forma individual los dobleces para despu&eacute;s intercambiar opiniones acerca de los dobleces y los nombres otorgados.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Para esta actividad se requieren rect&aacute;ngulos de diversas dimensiones.</P>
<P ALIGN="JUSTIFY">Despu&eacute;s de que los alumnos hayan nombrado las partes se le dar&aacute;n a conocer el nombre aceptado com&uacute;nmente.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>4 Comprobaci&oacute;n de las propiedades del rect&aacute;ngulo.</FONT></TD></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD WIDTH="17%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Dado un rect&aacute;ngulo por superposici&oacute;n comprueben:<br>
a) si los cuatro &aacute;ngulos son rectos e iguales;<br>
b) si los cuatro lados a veces no son iguales;<br>
c) si las parejas de lados opuestos son iguales entre s&iacute;.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">En equipos de 3 tratar&aacute;n de realizar la comprobaci&oacute;n.</P>
<P ALIGN="JUSTIFY">Se intercambiar&aacute;n opiniones en los mismos equipos.</P>
<P ALIGN="JUSTIFY">Los resultados y experiencias se intercambiar&aacute;n ante el grupo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno alcance un nivel de pensamiento que le permita realizar comprobaciones iniciales y no formales.</P>
<P ALIGN="JUSTIFY">Para la actividad se utilizar&aacute;n rect&aacute;ngulos de diversas dimensiones.</FONT></TD>
</TR>
</TABLE>

<h3>FIGURA: ROMBO</h3>
<TABLE BORDER=1 width=100%>
<TR>
<td colspan=5><FONT FACE="Arial Narrow" SIZE=2><P><b>Nombre de la Actividad</b></FONT></TD>
</tr>
<tr>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Nivel</b></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Fase</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>CONSIGNA</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>PLAN DE TRABAJO</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>OBSERVACIONES</b></FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>5 Construcci&oacute;n de un rombo.<br>
M&eacute;todo I.</FONT>
 </TD><td width=50% align=right>
 <img src='e03.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD WIDTH="17%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo AB'CD' y obtengan la diagonal AC.<br>
2.- Sobrepongan A y C para formar un doblez perpendicular a la diagonal en su punto medio (el punto O).<br>
3.- El punto B se forma con la intersecci&oacute;n del doblez del paso 3 con el lado B'C.<br>
4.- El punto D se forma con la intersecci&oacute;n del doblez del paso 3 con el lado AD'.<br>
5.- Doblen de C a D y corten el tri&aacute;ngulo que se forma con los puntos C, D y D'. Hagan lo mismo doblando de A a B y cortando el tri&aacute;ngulo ABB'.<br>
6.- El cuadril&aacute;tero ABCD es un rombo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se colocar&aacute;n en c&iacute;rculo los alumnos para realizar de manera individual los dobleces.<br>
Identificar&aacute;n en equipos las partes del rombo y las mencionar&aacute;n junto con algunas caracter&iacute;sticas que se observen.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno identifique la forma de la figura (el rombo) utilizando la orientaci&oacute;n dirigida, pasando posteriormente al intercambio de experiencias.<br>
Al partir de rect&aacute;ngulos se sugiere que en estas dos actividades se utilicen rect&aacute;ngulos de distintas dimensiones, incluyendo cuadrados o casi cuadrados.</FONT></TD>
</TR>
<TR>
<TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>6 Construcci&oacute;n de un rombo.<br>
M&eacute;todo II.</FONT>
 </TD><td width=50% align=right>
 <img src='e03.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Dado un rect&aacute;ngulo A'B'C'D', hagan dobleces en la mitad superponiendo el lado A'D' sobre B'C' y A'B' sobre C'D' para obtener los puntos medios de las lados A, B, C, D y el punto central O.<br>
2.- Hagan un doblez que vaya de A a B, otro que vaya de B a C, otro de C a D y otro de D a A.<br>
3.- Eliminen los tri&aacute;ngulos que se forman en las esquinas del rect&aacute;ngulo.<br>
4.- La figura resultante es un rombo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se colocar&aacute;n en c&iacute;rculo los alumnos para realizar de manera individual los dobleces.<br>
Identificar&aacute;n en equipos las partes del rombo y las mencionar&aacute;n junto con algunas caracter&iacute;sticas que se observen.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno identifique la forma de la figura (el rombo) utilizando la orientaci&oacute;n dirigida, pasando posteriormente al intercambio de experiencias.<br>
Al partir de rect&aacute;ngulos se sugiere que en estas dos actividades se utilicen rect&aacute;ngulos de distintas dimensiones, incluyendo cuadrados o casi cuadrados.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>7 Relaci&oacute;n existente entre los rombos y los rect&aacute;ngulos.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">3</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Construyan un rombo que tenga diagonales de aproximadamente 20 cm y 14 cm.<br>
2.- Rec&oacute;rtenlo y doblen las puntas de tal manera que sigan sobre el centro.<br>
3.- Responda:<br>
&nbsp;&nbsp;a) ¿qu&eacute; figura se forma?</P>
&nbsp;&nbsp;b) ¿c&oacute;mo es su tama&ntilde;o comparado con el del rombo?</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Cada alumno realizar&aacute; el rombo y los dobleces.<br>
En equipos de 3 comentar&aacute;n las caracter&iacute;sticas de la figura resultante.<br>
En el grupo de intercambiar&aacute;n los resultados y observaciones.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se intenta, al convertir un rombo en un rect&aacute;ngulo, que el alumno observe las relaciones entre estados dos figuras y las ubique como &quot;parientes&quot; dentro del mismo grupo de cuadril&aacute;teros (los paralelogramos).</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>8 Comprobaci&oacute;n de las propiedades del rombo.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">III</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Construyan un rombo y por superposici&oacute;n comprueben:<br>
&nbsp;&nbsp;a) si los cuatro lados son iguales;<br>
&nbsp;&nbsp;b) si las diagonales son perpendiculares entre s&iacute;;<br>
&nbsp;&nbsp;c) si el punto O es el punto medio de las diagonales;<br>
&nbsp;&nbsp;d) si los &aacute;ngulos opuestos son iguales;<br>
&nbsp;e) si es un paralelogramo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El grupo se organizar&aacute; en parejas.<br>
Individualmente se realizar&aacute; la construcci&oacute;n de los rombos.<br>
En equipo se realizar&aacute;n las comprobaciones.<br>
Se intercambiar&aacute;n experiencias y observaciones en el grupo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno determine las caracter&iacute;sticas que no var&iacute;an en los rombos, para lo cual se necesitar&aacute;n rombos de distintas dimensiones y el intercambio de experiencias entre los alumnos.</FONT></TD>
</TR>
</TABLE>

<h3>FIGURA: CUADRADO</h3>
<TABLE BORDER=1 width=100%>
<TR>
<td colspan=5><FONT FACE="Arial Narrow" SIZE=2><P><b>Nombre de la Actividad</b></FONT></TD>
</tr>
<tr>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Nivel</b></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Fase</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>CONSIGNA</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>PLAN DE TRABAJO</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>OBSERVACIONES</b></FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>9 Construcci&oacute;n de un cuadrado.</FONT>
 </TD><td width=50% align=right>
 <img src='e04.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- tomen un rect&aacute;ngulo cualquiera y d&oacute;blenlo de tal manera que un lado corto coincida con un lado largo. El resultado es una figura hecha por un tri&aacute;ngulo y un rect&aacute;ngulo m&aacute;s peque&ntilde;o.<br>
2.- Doblen por la l&iacute;nea que une al tri&aacute;ngulo con el rect&aacute;ngulo peque&ntilde;o y corten por ah&iacute; utilizando la navaja.<br>
3.- Al quitar el rect&aacute;ngulo peque&ntilde;o queda &uacute;nicamente un tri&aacute;ngulo doble. Desd&oacute;blenlo y se obtiene un cuadrado.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">De manera individual se llevar&aacute;n a cabo los dobleces y los cortes.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno comience a construir cuadrados.<br>
Al igual que en otras actividades, se sugiere utilizar rect&aacute;ngulos de diversas dimensiones.</FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>10 Determinar las partes del cuadrado.</FONT>
 </TD><td width=50% align=right>
 <img src='e05.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un cuadrado y hagan un doblez que vaya de esquina a esquina. ¿C&oacute;mo llamar&iacute;an a este doblez?<br>
2.- Hagan otro doblez que el otro par de esquinas.<br>
3.- Observen el punto donde se cruzan los dobleces. ¿C&oacute;mo llamar&iacute;an a ese punto?<br>
4.- Ese punto, ¿c&oacute;mo divide a cada uno de los dobleces?<br>
5.- ¿Qu&eacute; &aacute;ngulo forman los dobleces entre s&iacute;?</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar a los alumnos en equipos de tres integrantes.<br>
Se har&aacute;n los dobleces y las comprobaciones de manera individual.<br>
Se comparar&aacute;n los resultados dentro de los equipos y, posteriormente, en el grupo.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno determine y nombre cu&aacute;les son las partes del cuadrado que siempre se presentan, aunque var&iacute;en de tama&ntilde;o.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>11 Comprobaci&oacute;n de que el cuadrado es un caso particular de los rect&aacute;ngulos.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un cuadrado y apliquen las propiedades del rect&aacute;ngulo:<br>
Comprobar que<br>
&nbsp;&nbsp;a) los cuatro &aacute;ngulos son iguales;<br>
&nbsp;&nbsp;b) los lados opuestos son iguales entre s&iacute;;<br>
&nbsp;&nbsp;c) las diagonales se cortan entre s&iacute; en sus puntos medios.<br>
(Actividad no.&nbsp;4.)</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se formar&aacute;n equipos de tres integrantes para intentar hacer la demostraci&oacute;n en equipo.<br>
Se comparar&aacute;n los resultados en cada equipo.<br>
Se comparar&aacute;n los resultados, las observaciones y las conclusiones a nivel grupal.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno relacione las caracter&iacute;sticas de los rect&aacute;ngulos que posee el cuadrado para finalmente concluir que &eacute;ste &uacute;ltimo es un caso particular de aqu&eacute;llos.<br>
Nuevamente, y es importante, se sugiere utilizar cuadrados de diversas dimensiones para evitar el creer que el tama&ntilde;o influye en este tipo de relaciones.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>12 Comprobaci&oacute;n de que el cuadrado es un caso particular de los rombos.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un cuadrado y apliquen las propiedades del rombo:<br>
Comprobar que<br>
&nbsp;&nbsp;a) los cuatro lados son iguales;<br>
&nbsp;&nbsp;b) las diagonales son perpendiculares entre s&iacute;;<br>
&nbsp;&nbsp;c) los &aacute;ngulos opuestos son iguales.
<br>(Actividad no.&nbsp;8.)</FONT></TD>
<TD WIDTH="17%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se formar&aacute;n equipos de tres integrantes para intentar hacer la demostraci&oacute;n en equipo.<br>
Se comparar&aacute;n los resultados en cada equipo.<br>
Se comparar&aacute;n los resultados, las observaciones y las conclusiones a nivel grupal.</FONT></TD>
<TD WIDTH="16%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno relacione las caracter&iacute;sticas de los rombos que posee el cuadrado para relacionarlos entre s&iacute; y concluir que &eacute;ste es un caso particular de aqu&eacute;llos.<br>
Nuevamente es importante utilizar cuadrados de distintas dimensiones.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>13 Comprobaci&oacute;n de las car&aacute;cter&iacute;sticas generales de los cuadrados.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">III</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un cuadrado y, por superposici&oacute;n, comprueben las propiedades del cuadrado:<br>
a) si los cuatro lados son iguales;<br>
b) si los cuatro &aacute;ngulos son iguales;<br>
c) si sus diagonales son perpendiculares entre s&iacute; y se cortan en sus puntos medios.</FONT></TD>
<TD WIDTH="17%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se formar&aacute;n equipos de tres integrantes.<br>
Se har&aacute;n los dobleces de manera individual.<br>
Se comparar&aacute;n los resultados por equipo.<br>
Se comparar&aacute;n los resultados, las observaciones y las conclusiones a nivel grupal, estableciendo relaciones entre esta actividad y las dos anteriores.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno generalice las caracter&iacute;sticas inmutables de los cuadrados y lo considere como rect&aacute;ngulo y rombo, simult&aacute;neamente.</FONT></TD>
</TR>
</TABLE>

<h3>FIGURA: TRAPECIO</h3>
<TABLE BORDER=1 width=100%>
<TR>
<td colspan=5><FONT FACE="Arial Narrow" SIZE=2><P><b>Nombre de la Actividad</b></FONT></TD>
</tr>
<tr>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Nivel</b></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Fase</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>CONSIGNA</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>PLAN DE TRABAJO</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>OBSERVACIONES</b></FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>14 Construcci&oacute;n de un trapecio.</FONT>
 </TD><td width=50% align=right>
 <img src='e06.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo y elijan un lado al que llamaremos &quot;borde&quot;.<br>
2.- En el lado opuesto a la &quot;base&quot; escojan un punto.<br>
3.- Unan los extremos de la &quot;base&quot; con el punto que escogieron utilizando dos dobleces.<br>
4.- Hagan un doblez que sea paralelo a la &quot;base&quot;.<br>
5.- En la parte inferior, pegada a la &quot;base&quot;, se forma una figura de cuatro lados a la que llamaremos trapecio.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El grupo se organiza en equipos de 2 &oacute; 3 integrantes.<br>
Los dobleces y las construcciones se realizan de manera individual.<br>
Se comparan los resultados en los equipos.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno logre una visualizaci&oacute;n general de los trapecios.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>15 Partes de los trapecios.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">II</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un trapecio y d&oacute;blenlo por dos esquinas opuestas. El doblez que resulta es una diagonal.<br>
2.- La otra diagonal se obtiene de manera semejante, pero usando el otro par de esquinas.<br>
3.- EL punto donde se cruzan las diagonales, ¿c&oacute;mo lo llamar&iacute;as?<br>
4.- El lado que llamamos inicialmente &quot;base&quot; se le llama &quot;base mayor&quot;.<br>
5.- Al lado opuesto a la &quot;base mayor&quot; se le llama &quot;base menor&quot;.<br>
6.- Las dos &quot;bases&quot;, ¿son paralelas entre s&iacute;?</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Despu&eacute;s de organizar por equipos al grupo, los dobleces y la observaci&oacute;n se llevar&aacute; a cabo individualmente, para posteriormente intercambiar experiencias en los equipos.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El alumno determinar&aacute; qu&eacute; partes del trapecio son invariables, sin considerar cuestiones de tipo cuantitativo.</FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>16 Construcci&oacute;n de un trapecio escaleno.</FONT>
 </TD><td width=50% align=right>
 <img src='e07.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo y hagan el mismo procedimiento que se hizo para hacer el trapecio (actividad 14), con la peque&ntilde;a diferencia de que el punto escogido en el lado opuesto a la &quot;base&quot; NO sea el punto medio.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se organizan a los alumnos por equipos. La construcci&oacute;n se lleva individualmente y, al final, se comparan resultados en los equipos.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El alumno podr&aacute; visualizar la forma general de un trapecio escaleno y, s&oacute;lo en caso de conocer a los tri&aacute;ngulos escalenos, podr&aacute; comparar su forma y su forma con &eacute;stos &uacute;ltimos.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>17 Propiedades de los trapecios escalenos.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">III</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un trapecio escaleno y comprueben que:<br>
&nbsp;&nbsp;a) las dos bases son paralelas entre s&iacute;;<br>
&nbsp;&nbsp;b) los dos lados que no son bases NO son iguales;<br>
&nbsp;&nbsp;c) las diagonales tampoco son iguales.<br>
2.- Si saben acerca del tri&aacute;ngulo escaleno establecer la relaci&oacute;n &eacute;ste por lo del nombre.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">En equipos de tres integrantes llevar a cabo la actividad.<br>
Comentar dentro del equipo los resultados y posteriormente comentarlos a nivel grupal.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno generalice las caracter&iacute;sticas de los trapecios escalenos.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>18 Construcci&oacute;n de un trapecio is&oacute;sceles.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo y hagan el mismo proceso que se sigui&oacute; para el trapecio (actividad 14), pero ahora el punto elegido debe ser el PUNTO MEDIO del lado opuesto a la base.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar equipos y doblar individualmente. Comparar los dobleces en los equipos y plantear la cuesti&oacute;n del nombre.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El alumno podr&aacute; visualizar la forma general de los trapecios is&oacute;sceles y, s&oacute;lo si conoce los tri&aacute;ngulos is&oacute;sceles, podr&aacute; comparar en forma y nombre aqu&eacute;llos con &eacute;stos.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>19 Propiedades del trapecio is&oacute;sceles.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">III</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un trapecio is&oacute;sceles y comprueben que:<br>
&nbsp;&nbsp;a) las dos bases son paralelas;<br>
&nbsp;&nbsp;b) los lados que no son bases son iguales;<br>
&nbsp;&nbsp;c) las diagonales son iguales;<br>
&nbsp;&nbsp;d) los &aacute;ngulos en los extremos de la base mayor son iguales; y<br>
&nbsp;&nbsp;e) los &aacute;ngulos en los extremos de la base menor son iguales.<br>
2.- Si saben acerca del tri&aacute;ngulo is&oacute;sceles establecer la relaci&oacute;n con &eacute;ste por lo del nombre.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar el grupo en equipos de tres alumnos.<br>
Realizar las comprobaciones y comentar los resultados en los equipos.<br>
Posteriormente comentar los resultados y observaciones a nivel grupal.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno determine las caracter&iacute;sticas y propiedades generales de los trapecios is&oacute;sceles, sin importar criterios cuantitativos.</FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>20 Construcci&oacute;n de un trapecio rect&aacute;ngulo.</FONT>
 </TD><td width=50% align=right>
 <img src='e08.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un rect&aacute;ngulo y realicen el mismo procedimiento que se llev&oacute; a cabo para construir el trapecio (actividad 14) pero el punto escogido debe ser uno de los dos extremos del lado opuesto a la &quot;base&quot;.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar el grupo en equipos de tres alumnos.<br>
Realizar la construcci&oacute;n de manera individual.<br>
Comentar los resultados en los equipos.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">El alumno podr&aacute; crear y visualizar los trapecios rect&aacute;ngulos a partir de un rect&aacute;ngulo, form&aacute;ndose una idea general de los mismos.</FONT></TD>
</TR>
<TR><TD colspan=5>
<FONT FACE="Arial Narrow" SIZE=2><P>21 Propiedades del trapecio rect&aacute;ngulo.</FONT></TD>
</tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">III</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">4</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un trapecio rect&aacute;ngulo y comprueben:<br>
&nbsp;&nbsp;a) si las dos bases son paralelas;<br>
&nbsp;&nbsp;b) si los lados que no son bases NO son iguales;<br>
&nbsp;&nbsp;c) si los &aacute;ngulos en los extremos de uno de los dos lados que no son bases son rectos.<br>
2.- Si saben acerca del tri&aacute;ngulo rect&aacute;ngulo establecer la posible relaci&oacute;n a trav&eacute;s del nombre.<br>
3.- Determinen si el trapecio rect&aacute;ngulo es trapecio is&oacute;sceles o trapecio escaleno.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar al grupo en equipos de tres.<br>
Realizar los dobleces y las observaciones inicialmente de manera individual.<br>
Comparar los resultados por equipos y, posteriormente, a nivel grupal junto con las conclusiones.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que el alumno determine las propiedades y caracter&iacute;sticas generales de los trapecios rect&aacute;ngulos y establecer, s&oacute;lo si conocen los tri&aacute;ngulos rect&aacute;ngulos, una analog&iacute;a con &eacute;stos a trav&eacute;s del nombre.<br>
Finalmente el alumno establecer&aacute; una relaci&oacute;n de esta figura con las propiedades de los trapecios escalenos para concluir que aqu&eacute;llos son un subconjunto de &eacute;stos &uacute;ltimos.</FONT></TD>
</TR>
</TABLE>

<h3>FIGURA: TRAPEZOIDE</h3>
<TABLE BORDER=1 width=100%>
<TR>
<td colspan=5><FONT FACE="Arial Narrow" SIZE=2><P><b>Nombre de la Actividad</b></FONT></TD>
</tr>
<tr>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Nivel</b></FONT></TD>
<TD WIDTH="11%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>Fase</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>CONSIGNA</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>PLAN DE TRABAJO</b></FONT></TD>
<TD WIDTH="26%" VALIGN="TOP">
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER"><b>OBSERVACIONES</b></FONT></TD>
</TR>
<TR><TD colspan=5>
 <table width=100% border=0>
 <tr valign=top><td width=50%>
 <FONT FACE="Arial Narrow" SIZE=2><P>22 Construcci&oacute;n de un trapezoide.</FONT>
 </TD><td width=50% align=center bgcolor=gray>
 <img src='e09.gif'>
 </td></tr></table>
</td></tr>
<tr valign=top>
<TD>
<FONT SIZE=2><P ALIGN="CENTER">I</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="CENTER">2</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">1.- Tomen un cuadrado y h&aacute;ganle un doblez que pase por el centro, pero que no sea diagonal.<br>
2.- Corten por el doblez hecho.<br>
3.- Se han obtenido dos figuras congruentes, ¿qu&eacute; son?<br>
4.- Se hace ahora otro doblez que pase por el centro del cuadrado inicial y que sea perpendicular al primer doblez.<br>
5.- Corten por el doblez realizado.<br>
6.- Se han obtenido cuatro figuras. ¿Qu&eacute; son?, ¿c&oacute;mo son?</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Organizar al grupo por parejas.<br>
Realizar individualmente los dobleces y compararlos con su pareja.</FONT></TD>
<TD>
<FONT FACE="Arial Narrow" SIZE=2><P ALIGN="JUSTIFY">Se pretende que, con la ayuda de todo el grupo, el alumno encuentra las caracter&iacute;sticas que tienen los trapezoides.<br>
Al igual que en actividades anteriores, es recomendable utilizar cuadrados de distintos tama&ntilde;os.</FONT></TD>
</TR>
</TABLE>

<p>&nbsp;</p>
<center>
<table width=60% border=1><tr><td align=center>
<font size=4>Regresar a: <a href='index.html'><b><i>Doblando la Geometría</i></b></a></font>
</td></tr></table></center>

<hr>
<font color=brown>
<font face='Verdana,Arial,Helvetica,sans-serif' size=1>
<p>Este sitio está a cargo de <a href='mailto:vil@sunserver.uaq.mx?subject=Desde DG: '>Víctor Larios Osorio</a>.<br>
<img src='../redm/img/cr.gif' widh=10 height=10 hspace=2 align=center>1994, Noraísa González González y Víctor Larios Osorio.<br>
Última actualización: Junio 2001.</p>
</font>


</BODY>
</HTML>
