<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Hugo A. Gallo">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.04 [en] (Win95; I) [Netscape]">
   <TITLE>origami 4</TITLE>
</HEAD>
<BODY>

<H1>
<A NAME="Aprendiendo las Bases"></A><FONT COLOR="#006600">Aprendiendo las
Bases:</FONT></H1>

<H2>
Bases</H2>
1955 Yoshizawa, su primer libro, "Atarashi Origami Geijutsu", ("Nuevo Arte
de plegado de papel") fue publicado, y contiene las l&iacute;neas de puntos
familiares diferentes para valle y pliegues de monta&ntilde;a.

<P>Tambi&eacute;n en el verano de 1955, Gershon Legman tuvo la primera
exhibici&oacute;n de Yoshizawa en el Oeste, en Amsterdam. Desde entonces,
Yoshizawa fue extensamente conocido en el Oeste, por como hizo su sistema
de l&iacute;neas de puntos y flechas para diagramas. Una tirada temprana
del Origamian de 1958 se anuncia la decisi&oacute;n Origami Center exclusivamente
para emplear el sistema de Yoshizawa para todos sus diagramas.

<P>El sistema de l&iacute;neas de puntos y flechas, fue ideado por Yoshizawa,
esto es una gran probabilidad. La fecha real hubiera sido 1950 o m&aacute;s
temprano. Se pudo observar que Honda ha continuado usando su "P" s&iacute;mbolo
para sus muchos libros, incluso en "El Mundo del Origami" de 1965. M&aacute;s
tarde, Robert Harbin introdujo el pliegue de calabaza, pliegue de p&eacute;talo,
oreja de conejo, etc. En "Magia de Papel" en 1956. Pero aunque &eacute;l
entonces conoce acerca de Yoshizawa, &eacute;l no us&oacute; sus l&iacute;neas
de puntos en los libros. Ellos estaban dise&ntilde;ados por Rolf Harris,
eran dibujos a pulso. Poco despu&eacute;s, en correspondencia privada,
Sam Randlett y Robert Harbin convinieron que era un sistema comprensivo
de s&iacute;mbolos y terminolog&iacute;a. Estas incluyeron las bases regulares
y en estos estaban dados los nombres ahora familiares de <B><I>pliegue
prelimina</I></B>r, <B><I>base bomba de agua</I></B>, base blintz, <B><I>base
de pescado</I></B>, <B><I>base p&aacute;jaro</I></B>, <B><I>base rana</I></B>.
Alguno de estos t&eacute;rminos, como "pliegue preliminar", "bomba de agua"
y "base blintz" (t&eacute;rmino inventado por Gershon Legman).

<P>El sistema frecuentemente llamado "Sistema Yoshizawa-Randlett". El nombre
fue dado por alguien con conocimiento parciales de los hechos, y tal vez
por que el sistema fue primero completamente descripto por Sam Randlett
en su libro "El Arte de Origami" (1961). La inspecci&oacute;n de Robert
Harbin en su libro "Paper Magic" (1956), escrito antes de que Sam Randlett
se interesara por el origami, es suficiente para probar que los t&eacute;rminos
"pliegue de calabaza", "p&eacute;talo" fueron inventados por Harbin. Sam
Randlett pens&oacute; que fue bueno que todas las bases estuvieran derivadas
unas de otras, pero en el proceso la base "molino de viento" parece haberse
ido del camino. El sistema completo primero apareci&oacute; en el "Arte
de Origami" de Randlett en 1961, seguido por "The best of Origami" en 1963.
Ya en 1964, la publicaci&oacute;n de "Secretos de Origami" antes que Robert
Harbin aplicara los mismos s&iacute;mbolos con unas pocas modificaciones.
Con este sistema familiar de s&iacute;mbolos para origami fueron completados.
Debe ser separado del uso del sistema b&aacute;sico de l&iacute;neas y
flechas del japon&eacute;s Yoshizawa, ellos omiten m&aacute;s de nuestra
terminolog&iacute;a.

<P>Bases "cl&aacute;sicas". "Cl&aacute;sico" es un t&eacute;rmino algo
suelto. Algunos restringir&iacute;an el t&eacute;rmino a esas bases, cuando
comenzaron a doblar figuras planas, en forma de diamante: Cometa, diamante,
pescado, ave y bases de rana. Ellos fueron consideradas por el Dr. Sol&oacute;rzano
Sagredo como "Deltoides". En los d&iacute;as del moderno "origami", "papiroflexia",
"paperfolding", all&iacute; fue una tendencia por algunos por considerarlas
solamente "bases" y ellos estaban imbuidos con un casi m&iacute;stico significado.
Un concepto m&aacute;s amplio de "Bases Cl&aacute;sicas" extienden el t&eacute;rmino
a Pliegue Preliminar, bomba de agua (waterbomb base), base blintz, <B><I>molino
de viento</I></B> y ex&oacute;ticos tal como el base de ave y la base de
ave estirada. Una base es solamente un escenario en el proceso del plegado

<P>Llenos de una colecci&oacute;n de bases y t&eacute;cnicas b&aacute;sicas
de plegados, hacen al sistema con variaciones en s&iacute;mbolos y distintos
modos de hacer plegados.

<P>Se podr&iacute;a suponer que las bases de David Brill o quiz&aacute;s
las de Max Hulme, fueron desarrolladas independientemente en el a&ntilde;o
1970 y usadas en varios modos para animales plegados. Ellas no han sido
publicadas, excepto en sus explicaciones, aparecer como instrucciones de
plegados para esos modelos.
<BR>&nbsp;
<H2>
<A NAME="Diagramas de las Bases"></A><B><FONT SIZE=+2>Diagramas de las
Bases</FONT></B></H2>

<CENTER>
<H3>
<A NAME="base cometa"></A>Base "cometa" o "rombo"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="501" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases01.jpg" NOSAVE HEIGHT=370 WIDTH=294></TD>

<TD>Una de las Bases m&aacute;s simples,&nbsp;
<BR>base deltoide m&aacute;s utilizada por el Dr. Vicente Sol&oacute;rzano
Sagredo.</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<CENTER>
<H3>
&nbsp;<A NAME="base pez"></A>Base "pez"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="372" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases02.jpg" NOSAVE HEIGHT=315 WIDTH=247></TD>

<TD>Fish Base&nbsp;
<BR>&nbsp;

<P>Seal Base</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<CENTER>
<H3>
&nbsp;<A NAME="base rana"></A>Base "rana"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="668" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases03.jpg" NOSAVE HEIGHT=370 WIDTH=516></TD>

<TD>A partir de la base preliminar, obtenemos la base rana &oacute; Frog
Base</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<CENTER>
<H3>
&nbsp;<A NAME="base bomba de agua"></A>Base "bomba de agua"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="668" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases04.jpg" NOSAVE HEIGHT=83 WIDTH=468></TD>

<TD>Waterbomb base</TD>
</TR>
</TABLE></CENTER>

<CENTER>
<H3>
&nbsp;<A NAME="base preliminar"></A>Base "preliminar"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="670" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases05.jpg" NOSAVE HEIGHT=119 WIDTH=558></TD>

<TD>Preliminar base</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<CENTER>
<H3>
<A NAME="base pájaro"></A>Base "p&aacute;jaro"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="675" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases06.jpg" NOSAVE HEIGHT=184 WIDTH=495></TD>

<TD>A partir de la base preliminar, llagamos a la base p&aacute;jaro &oacute;
Bird base</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<CENTER>
<H3>
<A NAME="base molino de"></A> Base "molino de viento"</H3></CENTER>

<CENTER><TABLE BORDER COLS=2 WIDTH="680" HEIGHT="100" >
<TR>
<TD><IMG SRC="classes/WebSite/bases07.jpg" NOSAVE HEIGHT=336 WIDTH=366></TD>

<TD>

<P>Paso 6 (step 6): llevar "a" hacia el punto lateral medio, "b" llevarla
hacia arriba. de igual manera&nbsp;
<BR>haremos con las puntas restantes.</TD>
</TR>
</TABLE></CENTER>
&nbsp;
<DIV ALIGN=right><A HREF="#diagrama de plegados"><IMG SRC="../../ensayosweb/classes/WebSite/up.gif" NOSAVE HEIGHT=32 WIDTH=31></A></DIV>

<DIV ALIGN=right><I><A HREF="origami1.htm#Origami 1 Top Page">Volver a
la p&aacute;gina principal</A></I></DIV>

</BODY>
</HTML>
