0                              177.0        0.4509967379742122  
00                             52.0         0.9829666607012196  
000                            117.0        0.6307841425898572  
0000                           2.0          2.3979400086720375  
00000                          1.0          2.6989700043360187  
000000                         2.0          2.3979400086720375  
00000000                       1.0          2.6989700043360187  
00000001                       1.0          2.6989700043360187  
00000011                       1.0          2.6989700043360187  
00000111                       1.0          2.6989700043360187  
0002                           1.0          2.6989700043360187  
00027                          1.0          2.6989700043360187  
00080                          1.0          2.6989700043360187  
001                            3.0          2.221848749616356   
00167                          1.0          2.6989700043360187  
002                            2.0          2.3979400086720375  
0022                           1.0          2.6989700043360187  
0028                           1.0          2.6989700043360187  
003                            2.0          2.3979400086720375  
0036                           1.0          2.6989700043360187  
00368                          1.0          2.6989700043360187  
004                            1.0          2.6989700043360187  
0045100608                     1.0          2.6989700043360187  
005                            1.0          2.6989700043360187  
006                            3.0          2.221848749616356   
0065                           1.0          2.6989700043360187  
007                            1.0          2.6989700043360187  
0070522633                     1.0          2.6989700043360187  
0073                           1.0          2.6989700043360187  
008000                         1.0          2.6989700043360187  
009                            1.0          2.6989700043360187  
01                             62.0         0.906578314837765   
011                            1.0          2.6989700043360187  
01101010                       1.0          2.6989700043360187  
01180                          1.0          2.6989700043360187  
0124004504                     1.0          2.6989700043360187  
0126                           1.0          2.6989700043360187  
0127784608                     1.0          2.6989700043360187  
013                            3.0          2.221848749616356   
0134                           1.0          2.6989700043360187  
0149                           1.0          2.6989700043360187  
016                            3.0          2.221848749616356   
017                            1.0          2.6989700043360187  
019                            1.0          2.6989700043360187  
0198250800                     1.0          2.6989700043360187  
02                             40.0         1.0969100130080565  
020                            2.0          2.3979400086720375  
0201533774                     1.0          2.6989700043360187  
0206                           1.0          2.6989700043360187  
0207                           1.0          2.6989700043360187  
021                            2.0          2.3979400086720375  
02175                          1.0          2.6989700043360187  
0231149549                     1.0          2.6989700043360187  
024                            1.0          2.6989700043360187  
025                            1.0          2.6989700043360187  
02506                          1.0          2.6989700043360187  
027                            1.0          2.6989700043360187  
0275990168                     1.0          2.6989700043360187  
03                             33.0         1.1804560644581314  
030                            2.0          2.3979400086720375  
0337                           1.0          2.6989700043360187  
034                            1.0          2.6989700043360187  
036                            2.0          2.3979400086720375  
037                            1.0          2.6989700043360187  
03885                          1.0          2.6989700043360187  
039                            2.0          2.3979400086720375  
0393052362                     1.0          2.6989700043360187  
04                             44.0         1.0555173278498313  
040                            1.0          2.6989700043360187  
041                            1.0          2.6989700043360187  
0412357701                     1.0          2.6989700043360187  
043                            1.0          2.6989700043360187  
045                            3.0          2.221848749616356   
049                            1.0          2.6989700043360187  
05                             44.0         1.0555173278498313  
050                            1.0          2.6989700043360187  
0500                           1.0          2.6989700043360187  
0513                           1.0          2.6989700043360187  
0521433630                     1.0          2.6989700043360187  
055                            2.0          2.3979400086720375  
056                            1.0          2.6989700043360187  
06                             51.0         0.9913998282380825  
060                            1.0          2.6989700043360187  
06182012                       1.0          2.6989700043360187  
0631                           1.0          2.6989700043360187  
067                            1.0          2.6989700043360187  
068                            2.0          2.3979400086720375  
06800                          1.0          2.6989700043360187  
0689                           1.0          2.6989700043360187  
07                             44.0         1.0555173278498313  
070                            1.0          2.6989700043360187  
0703                           1.0          2.6989700043360187  
0712                           1.0          2.6989700043360187  
071423                         1.0          2.6989700043360187  
0716730510                     1.0          2.6989700043360187  
0731                           1.0          2.6989700043360187  
0737305061                     1.0          2.6989700043360187  
075                            1.0          2.6989700043360187  
07502                          1.0          2.6989700043360187  
078125                         1.0          2.6989700043360187  
0791440435                     1.0          2.6989700043360187  
0795                           1.0          2.6989700043360187  
08                             43.0         1.0655015487564323  
080                            2.0          2.3979400086720375  
0800                           1.0          2.6989700043360187  
08009                          1.0          2.6989700043360187  
08015                          1.0          2.6989700043360187  
08034                          1.0          2.6989700043360187  
08036                          1.0          2.6989700043360187  
081                            1.0          2.6989700043360187  
083                            1.0          2.6989700043360187  
0836                           1.0          2.6989700043360187  
084                            1.0          2.6989700043360187  
086                            1.0          2.6989700043360187  
0878350667                     1.0          2.6989700043360187  
0878931899                     1.0          2.6989700043360187  
0878934805                     1.0          2.6989700043360187  
0888                           1.0          2.6989700043360187  
089                            1.0          2.6989700043360187  
09                             39.0         1.1079053973095196  
0902                           1.0          2.6989700043360187  
0905                           1.0          2.6989700043360187  
091                            3.0          2.221848749616356   
092                            1.0          2.6989700043360187  
0931411246                     1.0          2.6989700043360187  
0935526870                     1.0          2.6989700043360187  
095                            1.0          2.6989700043360187  
0974                           1.0          2.6989700043360187  
098                            1.0          2.6989700043360187  
1                              347.0        0.15864052954514507 
10                             225.0        0.3467874862246563  
100                            113.0        0.645891560852599   
1000                           19.0         1.4202164033831899  
10000                          3.0          2.221848749616356   
100000                         2.0          2.3979400086720375  
1000000                        1.0          2.6989700043360187  
10000000                       1.0          2.6989700043360187  
1001                           1.0          2.6989700043360187  
1007                           1.0          2.6989700043360187  
101                            14.0         1.5528419686577808  
1010                           2.0          2.3979400086720375  
1012                           2.0          2.3979400086720375  
10138                          1.0          2.6989700043360187  
1015                           2.0          2.3979400086720375  
1016                           4.0          2.0969100130080562  
1017                           1.0          2.6989700043360187  
1018                           2.0          2.3979400086720375  
102                            11.0         1.6575773191777938  
1020                           4.0          2.0969100130080562  
1024                           2.0          2.3979400086720375  
1027                           2.0          2.3979400086720375  
103                            9.0          1.744727494896694   
1035                           2.0          2.3979400086720375  
1038                           3.0          2.221848749616356   
104                            9.0          1.744727494896694   
10400                          1.0          2.6989700043360187  
1042                           2.0          2.3979400086720375  
1045                           1.0          2.6989700043360187  
1046                           1.0          2.6989700043360187  
10460                          1.0          2.6989700043360187  
1048576                        1.0          2.6989700043360187  
105                            10.0         1.6989700043360187  
10552882                       1.0          2.6989700043360187  
1056                           1.0          2.6989700043360187  
106                            10.0         1.6989700043360187  
1063                           2.0          2.3979400086720375  
1065                           1.0          2.6989700043360187  
1067                           1.0          2.6989700043360187  
107                            5.0          2.0                 
1070                           1.0          2.6989700043360187  
10703                          1.0          2.6989700043360187  
1073                           1.0          2.6989700043360187  
107417                         1.0          2.6989700043360187  
1078                           1.0          2.6989700043360187  
1079                           1.0          2.6989700043360187  
108                            14.0         1.5528419686577808  
1080                           4.0          2.0969100130080562  
108786798                      1.0          2.6989700043360187  
109                            11.0         1.6575773191777938  
10901                          2.0          2.3979400086720375  
1093                           2.0          2.3979400086720375  
109473654                      1.0          2.6989700043360187  
109618778                      1.0          2.6989700043360187  
11                             153.0        0.51427857351842    
110                            15.0         1.5228787452803376  
1100                           3.0          2.221848749616356   
110000776                      1.0          2.6989700043360187  
110055933                      1.0          2.6989700043360187  
110080227                      1.0          2.6989700043360187  
1105                           1.0          2.6989700043360187  
111                            9.0          1.744727494896694   
1111                           1.0          2.6989700043360187  
11111                          1.0          2.6989700043360187  
1111111                        1.0          2.6989700043360187  
11111111                       1.0          2.6989700043360187  
1119                           1.0          2.6989700043360187  
112                            11.0         1.6575773191777938  
1126                           1.0          2.6989700043360187  
11271                          1.0          2.6989700043360187  
113                            4.0          2.0969100130080562  
1137                           1.0          2.6989700043360187  
1138                           9.0          1.744727494896694   
114                            7.0          1.853871964321762   
11424546                       1.0          2.6989700043360187  
115                            5.0          2.0                 
1150                           1.0          2.6989700043360187  
1154                           1.0          2.6989700043360187  
11591                          1.0          2.6989700043360187  
116                            6.0          1.9208187539523751  
117                            9.0          1.744727494896694   
1170                           1.0          2.6989700043360187  
11723                          1.0          2.6989700043360187  
1174                           1.0          2.6989700043360187  
118                            7.0          1.853871964321762   
1181                           1.0          2.6989700043360187  
1183                           1.0          2.6989700043360187  
1185                           1.0          2.6989700043360187  
1186                           1.0          2.6989700043360187  
119                            11.0         1.6575773191777938  
1190                           3.0          2.221848749616356   
11935176                       1.0          2.6989700043360187  
1195                           1.0          2.6989700043360187  
1197962                        1.0          2.6989700043360187  
1198                           8.0          1.7958800173440752  
1199                           1.0          2.6989700043360187  
12                             159.0        0.4975728800155673  
120                            15.0         1.5228787452803376  
1200                           8.0          1.7958800173440752  
1205                           1.0          2.6989700043360187  
1206                           1.0          2.6989700043360187  
12081822                       1.0          2.6989700043360187  
1209106                        1.0          2.6989700043360187  
121                            6.0          1.9208187539523751  
1210203040                     1.0          2.6989700043360187  
1212                           1.0          2.6989700043360187  
1215                           1.0          2.6989700043360187  
122                            5.0          2.0                 
122018                         1.0          2.6989700043360187  
1223421228                     1.0          2.6989700043360187  
1223421412                     1.0          2.6989700043360187  
1223421524                     1.0          2.6989700043360187  
1223421587                     1.0          2.6989700043360187  
1223423807                     1.0          2.6989700043360187  
1223453407                     1.0          2.6989700043360187  
1223455986                     1.0          2.6989700043360187  
1223459970                     1.0          2.6989700043360187  
1223462037                     1.0          2.6989700043360187  
1223482667                     1.0          2.6989700043360187  
1223483905                     1.0          2.6989700043360187  
1223546918                     1.0          2.6989700043360187  
1223846570                     1.0          2.6989700043360187  
1224                           1.0          2.6989700043360187  
12280                          1.0          2.6989700043360187  
1229016613                     1.0          2.6989700043360187  
123                            10.0         1.6989700043360187  
1234                           1.0          2.6989700043360187  
12345                          2.0          2.3979400086720375  
124                            4.0          2.0969100130080562  
12426                          1.0          2.6989700043360187  
125                            11.0         1.6575773191777938  
1250                           3.0          2.221848749616356   
1257                           1.0          2.6989700043360187  
1258                           1.0          2.6989700043360187  
126                            6.0          1.9208187539523751  
1260                           4.0          2.0969100130080562  
1266                           1.0          2.6989700043360187  
127                            4.0          2.0969100130080562  
1274                           2.0          2.3979400086720375  
128                            11.0         1.6575773191777938  
12853                          1.0          2.6989700043360187  
12881                          1.0          2.6989700043360187  
129                            6.0          1.9208187539523751  
1295                           1.0          2.6989700043360187  
1298892575                     1.0          2.6989700043360187  
1299                           1.0          2.6989700043360187  
13                             127.0        0.595166283380062   
130                            13.0         1.585026652029182   
1300                           2.0          2.3979400086720375  
13000                          1.0          2.6989700043360187  
1302                           1.0          2.6989700043360187  
1304                           2.0          2.3979400086720375  
13054692                       1.0          2.6989700043360187  
131                            5.0          2.0                 
1314                           1.0          2.6989700043360187  
1315                           1.0          2.6989700043360187  
13163                          1.0          2.6989700043360187  
132                            5.0          2.0                 
1320                           2.0          2.3979400086720375  
13225                          1.0          2.6989700043360187  
133                            5.0          2.0                 
1332454332                     1.0          2.6989700043360187  
1333                           1.0          2.6989700043360187  
1335                           1.0          2.6989700043360187  
134                            4.0          2.0969100130080562  
1343                           1.0          2.6989700043360187  
135                            12.0         1.6197887582883939  
1351                           1.0          2.6989700043360187  
136                            6.0          1.9208187539523751  
1368                           10.0         1.6989700043360187  
137                            2.0          2.3979400086720375  
138                            3.0          2.221848749616356   
139                            4.0          2.0969100130080562  
14                             121.0        0.6161846340195687  
140                            9.0          1.744727494896694   
1400                           5.0          2.0                 
1406                           1.0          2.6989700043360187  
140616                         1.0          2.6989700043360187  
141                            3.0          2.221848749616356   
1413                           1.0          2.6989700043360187  
142                            3.0          2.221848749616356   
143                            4.0          2.0969100130080562  
144                            4.0          2.0969100130080562  
145                            5.0          2.0                 
14546794                       1.0          2.6989700043360187  
14585                          1.0          2.6989700043360187  
146                            2.0          2.3979400086720375  
1460                           1.0          2.6989700043360187  
147                            3.0          2.221848749616356   
1470                           1.0          2.6989700043360187  
148                            5.0          2.0                 
1480                           1.0          2.6989700043360187  
149                            5.0          2.0                 
1492                           3.0          2.221848749616356   
15                             158.0        0.5003129173815962  
150                            21.0         1.3767507096020994  
1500                           5.0          2.0                 
15000                          3.0          2.221848749616356   
15087959                       1.0          2.6989700043360187  
151                            2.0          2.3979400086720375  
1510                           1.0          2.6989700043360187  
1514                           1.0          2.6989700043360187  
152                            4.0          2.0969100130080562  
1525                           1.0          2.6989700043360187  
1528                           1.0          2.6989700043360187  
153                            8.0          1.7958800173440752  
1532                           1.0          2.6989700043360187  
1536                           1.0          2.6989700043360187  
1537                           1.0          2.6989700043360187  
154                            8.0          1.7958800173440752  
1543                           1.0          2.6989700043360187  
1544                           2.0          2.3979400086720375  
1546                           2.0          2.3979400086720375  
155                            8.0          1.7958800173440752  
1550                           1.0          2.6989700043360187  
1556                           1.0          2.6989700043360187  
1558604674                     1.0          2.6989700043360187  
156                            7.0          1.853871964321762   
1561                           1.0          2.6989700043360187  
157                            8.0          1.7958800173440752  
1571                           1.0          2.6989700043360187  
1573                           1.0          2.6989700043360187  
1575                           1.0          2.6989700043360187  
1578531                        1.0          2.6989700043360187  
158                            3.0          2.221848749616356   
1586032941                     1.0          2.6989700043360187  
1589                           1.0          2.6989700043360187  
159                            2.0          2.3979400086720375  
1591                           1.0          2.6989700043360187  
16                             101.0        0.6946486305533762  
160                            29.0         1.2365720064370627  
1600                           5.0          2.0                 
1601                           2.0          2.3979400086720375  
1602659                        1.0          2.6989700043360187  
1604                           1.0          2.6989700043360187  
1606                           1.0          2.6989700043360187  
1607                           1.0          2.6989700043360187  
1608                           2.0          2.3979400086720375  
1609                           2.0          2.3979400086720375  
161                            5.0          2.0                 
1611                           1.0          2.6989700043360187  
1614                           1.0          2.6989700043360187  
1616                           1.0          2.6989700043360187  
16197                          1.0          2.6989700043360187  
162                            6.0          1.9208187539523751  
16201743                       1.0          2.6989700043360187  
1621                           1.0          2.6989700043360187  
16215                          1.0          2.6989700043360187  
163                            2.0          2.3979400086720375  
1630                           1.0          2.6989700043360187  
1634                           1.0          2.6989700043360187  
16348                          1.0          2.6989700043360187  
1639                           1.0          2.6989700043360187  
164                            6.0          1.9208187539523751  
1641                           1.0          2.6989700043360187  
1642                           4.0          2.0969100130080562  
1644                           2.0          2.3979400086720375  
1645                           1.0          2.6989700043360187  
1647                           1.0          2.6989700043360187  
1648                           1.0          2.6989700043360187  
165                            10.0         1.6989700043360187  
16515                          1.0          2.6989700043360187  
166                            3.0          2.221848749616356   
1660                           1.0          2.6989700043360187  
1662                           1.0          2.6989700043360187  
1664                           1.0          2.6989700043360187  
167                            6.0          1.9208187539523751  
168                            5.0          2.0                 
1682                           1.0          2.6989700043360187  
1686                           1.0          2.6989700043360187  
1687                           1.0          2.6989700043360187  
169                            3.0          2.221848749616356   
1696                           1.0          2.6989700043360187  
17                             105.0        0.6777807052660807  
170                            10.0         1.6989700043360187  
1700                           2.0          2.3979400086720375  
1704                           1.0          2.6989700043360187  
171                            6.0          1.9208187539523751  
1714                           1.0          2.6989700043360187  
172                            5.0          2.0                 
1722                           1.0          2.6989700043360187  
1727                           2.0          2.3979400086720375  
173                            9.0          1.744727494896694   
1739                           1.0          2.6989700043360187  
174                            4.0          2.0969100130080562  
1740                           1.0          2.6989700043360187  
1741                           1.0          2.6989700043360187  
1743                           2.0          2.3979400086720375  
1745                           1.0          2.6989700043360187  
175                            5.0          2.0                 
1758                           1.0          2.6989700043360187  
176                            2.0          2.3979400086720375  
177                            3.0          2.221848749616356   
1773                           1.0          2.6989700043360187  
1777                           2.0          2.3979400086720375  
178                            4.0          2.0969100130080562  
1780                           1.0          2.6989700043360187  
1782                           1.0          2.6989700043360187  
1783                           1.0          2.6989700043360187  
1785                           1.0          2.6989700043360187  
1787                           3.0          2.221848749616356   
179                            1.0          2.6989700043360187  
1790                           1.0          2.6989700043360187  
1791                           1.0          2.6989700043360187  
17959839                       1.0          2.6989700043360187  
1796                           1.0          2.6989700043360187  
1797                           1.0          2.6989700043360187  
1798                           1.0          2.6989700043360187  
1799                           1.0          2.6989700043360187  
18                             123.0        0.6090648928966209  
180                            14.0         1.5528419686577808  
1800                           2.0          2.3979400086720375  
1801                           1.0          2.6989700043360187  
1802                           1.0          2.6989700043360187  
1805                           1.0          2.6989700043360187  
1807                           1.0          2.6989700043360187  
1809                           1.0          2.6989700043360187  
181                            3.0          2.221848749616356   
1814                           1.0          2.6989700043360187  
1818                           1.0          2.6989700043360187  
182                            4.0          2.0969100130080562  
1821                           1.0          2.6989700043360187  
1822                           1.0          2.6989700043360187  
1826                           2.0          2.3979400086720375  
183                            6.0          1.9208187539523751  
1831                           1.0          2.6989700043360187  
1832                           2.0          2.3979400086720375  
1834                           1.0          2.6989700043360187  
1838                           1.0          2.6989700043360187  
1839                           1.0          2.6989700043360187  
184                            4.0          2.0969100130080562  
1840                           1.0          2.6989700043360187  
18401922                       1.0          2.6989700043360187  
1842                           1.0          2.6989700043360187  
1844                           2.0          2.3979400086720375  
18441543                       1.0          2.6989700043360187  
1845                           2.0          2.3979400086720375  
1847                           1.0          2.6989700043360187  
1848                           1.0          2.6989700043360187  
1849                           1.0          2.6989700043360187  
185                            4.0          2.0969100130080562  
1850                           1.0          2.6989700043360187  
1851                           3.0          2.221848749616356   
1852                           2.0          2.3979400086720375  
1853                           3.0          2.221848749616356   
1854                           1.0          2.6989700043360187  
1856                           1.0          2.6989700043360187  
1857                           2.0          2.3979400086720375  
1858                           2.0          2.3979400086720375  
186                            6.0          1.9208187539523751  
1861                           1.0          2.6989700043360187  
1863                           3.0          2.221848749616356   
1864                           1.0          2.6989700043360187  
1865                           1.0          2.6989700043360187  
1866                           1.0          2.6989700043360187  
1868                           1.0          2.6989700043360187  
1869                           1.0          2.6989700043360187  
187                            5.0          2.0                 
1870                           2.0          2.3979400086720375  
1871                           1.0          2.6989700043360187  
1872                           2.0          2.3979400086720375  
1873                           4.0          2.0969100130080562  
1874                           1.0          2.6989700043360187  
1876                           3.0          2.221848749616356   
1877                           1.0          2.6989700043360187  
1878                           1.0          2.6989700043360187  
1879                           3.0          2.221848749616356   
188                            2.0          2.3979400086720375  
1880                           1.0          2.6989700043360187  
1883                           1.0          2.6989700043360187  
1884                           4.0          2.0969100130080562  
1885                           3.0          2.221848749616356   
1886                           2.0          2.3979400086720375  
1888                           5.0          2.0                 
1889                           1.0          2.6989700043360187  
189                            2.0          2.3979400086720375  
1891                           1.0          2.6989700043360187  
1892                           1.0          2.6989700043360187  
1893                           5.0          2.0                 
1894                           2.0          2.3979400086720375  
1895                           3.0          2.221848749616356   
1897                           2.0          2.3979400086720375  
1898                           3.0          2.221848749616356   
1899                           2.0          2.3979400086720375  
19                             114.0        0.6420651529995463  
190                            3.0          2.221848749616356   
1900                           6.0          1.9208187539523751  
1901                           3.0          2.221848749616356   
1902                           2.0          2.3979400086720375  
1903                           2.0          2.3979400086720375  
19030357                       1.0          2.6989700043360187  
1904                           1.0          2.6989700043360187  
1905                           1.0          2.6989700043360187  
1906                           1.0          2.6989700043360187  
1908                           2.0          2.3979400086720375  
1909                           2.0          2.3979400086720375  
191                            3.0          2.221848749616356   
1910                           4.0          2.0969100130080562  
1911                           4.0          2.0969100130080562  
1912                           12.0         1.6197887582883939  
1913                           2.0          2.3979400086720375  
1915                           1.0          2.6989700043360187  
1916                           3.0          2.221848749616356   
1917                           5.0          2.0                 
1918                           1.0          2.6989700043360187  
1919                           3.0          2.221848749616356   
192                            2.0          2.3979400086720375  
1920                           7.0          1.853871964321762   
1921                           2.0          2.3979400086720375  
1922                           4.0          2.0969100130080562  
1923                           7.0          1.853871964321762   
1924                           4.0          2.0969100130080562  
1925                           2.0          2.3979400086720375  
1926                           6.0          1.9208187539523751  
1927                           4.0          2.0969100130080562  
19279075                       1.0          2.6989700043360187  
1928                           7.0          1.853871964321762   
1929                           7.0          1.853871964321762   
193                            6.0          1.9208187539523751  
1930                           9.0          1.744727494896694   
1931                           10.0         1.6989700043360187  
1932                           4.0          2.0969100130080562  
1932100660                     1.0          2.6989700043360187  
1933                           6.0          1.9208187539523751  
1934                           7.0          1.853871964321762   
1935                           8.0          1.7958800173440752  
1936                           13.0         1.585026652029182   
1937                           8.0          1.7958800173440752  
1938                           17.0         1.4685210829577449  
1939                           11.0         1.6575773191777938  
194                            6.0          1.9208187539523751  
1940                           5.0          2.0                 
1941                           2.0          2.3979400086720375  
1942                           7.0          1.853871964321762   
1943                           7.0          1.853871964321762   
1944                           4.0          2.0969100130080562  
1945                           13.0         1.585026652029182   
1946                           9.0          1.744727494896694   
1947                           7.0          1.853871964321762   
1948                           14.0         1.5528419686577808  
1949                           7.0          1.853871964321762   
195                            5.0          2.0                 
1950                           20.0         1.3979400086720377  
1951                           9.0          1.744727494896694   
19513249                       1.0          2.6989700043360187  
1952                           11.0         1.6575773191777938  
1953                           8.0          1.7958800173440752  
1954                           13.0         1.585026652029182   
1955                           12.0         1.6197887582883939  
1956                           11.0         1.6575773191777938  
19562864                       1.0          2.6989700043360187  
19568336                       1.0          2.6989700043360187  
1957                           11.0         1.6575773191777938  
1958                           12.0         1.6197887582883939  
1959                           7.0          1.853871964321762   
196                            4.0          2.0969100130080562  
1960                           18.0         1.4436974992327127  
1961                           11.0         1.6575773191777938  
1962                           10.0         1.6989700043360187  
1963                           11.0         1.6575773191777938  
1964                           11.0         1.6575773191777938  
1965                           20.0         1.3979400086720377  
1966                           9.0          1.744727494896694   
1967                           10.0         1.6989700043360187  
1968                           8.0          1.7958800173440752  
1969                           16.0         1.494850021680094   
197                            6.0          1.9208187539523751  
1970                           26.0         1.2839966563652008  
1971                           11.0         1.6575773191777938  
1972                           11.0         1.6575773191777938  
1973                           11.0         1.6575773191777938  
1974                           9.0          1.744727494896694   
1975                           10.0         1.6989700043360187  
1976                           11.0         1.6575773191777938  
1977                           12.0         1.6197887582883939  
1978                           14.0         1.5528419686577808  
1979                           11.0         1.6575773191777938  
198                            6.0          1.9208187539523751  
1980                           16.0         1.494850021680094   
1981                           18.0         1.4436974992327127  
1982                           13.0         1.585026652029182   
1983                           16.0         1.494850021680094   
1984                           17.0         1.4685210829577449  
1985                           17.0         1.4685210829577449  
1986                           15.0         1.5228787452803376  
1987                           20.0         1.3979400086720377  
19878856                       1.0          2.6989700043360187  
1988                           16.0         1.494850021680094   
1989                           21.0         1.3767507096020994  
199                            6.0          1.9208187539523751  
1990                           23.0         1.337242168318426   
1991                           21.0         1.3767507096020994  
1992                           25.0         1.3010299956639813  
1993                           18.0         1.4436974992327127  
1994                           31.0         1.207608310501746   
1995                           27.0         1.2676062401770316  
1996                           20.0         1.3979400086720377  
1997                           38.0         1.1191864077192086  
1998                           39.0         1.1079053973095196  
1999                           31.0         1.207608310501746   
19999699                       1.0          2.6989700043360187  
2                              305.0        0.21467016498923297 
20                             143.0        0.543633966870957   
200                            61.0         0.9136401693252517  
2000                           60.0         0.9208187539523752  
20000                          1.0          2.6989700043360187  
2001                           45.0         1.045757490560675   
2002                           35.0         1.1549019599857433  
2003                           55.0         0.958607314841775   
2004                           47.0         1.0268721464003012  
20042000                       1.0          2.6989700043360187  
2005                           49.0         1.0087739243075051  
2006                           67.0         0.8728952016351924  
2007                           49.0         1.0087739243075051  
2008                           72.0         0.8416375079047503  
2009                           41.0         1.0861861476162833  
201                            2.0          2.3979400086720375  
2010                           36.0         1.1426675035687315  
2011                           43.0         1.0655015487564323  
2012                           55.0         0.958607314841775   
2013                           36.0         1.1426675035687315  
2014                           43.0         1.0655015487564323  
2015                           53.0         0.9746941347352298  
20151                          1.0          2.6989700043360187  
201510                         1.0          2.6989700043360187  
201513                         1.0          2.6989700043360187  
201530                         1.0          2.6989700043360187  
20156                          1.0          2.6989700043360187  
20157                          1.0          2.6989700043360187  
2016                           78.0         0.8068754016455384  
201621                         1.0          2.6989700043360187  
2017                           89.0         0.7495799976911061  
2018                           179.0        0.4461169733561256  
201820                         1.0          2.6989700043360187  
201824                         1.0          2.6989700043360187  
2019                           22.0         1.3565473235138126  
202                            4.0          2.0969100130080562  
2020                           13.0         1.585026652029182   
2021                           4.0          2.0969100130080562  
2022                           2.0          2.3979400086720375  
2023                           1.0          2.6989700043360187  
2024                           1.0          2.6989700043360187  
2025                           3.0          2.221848749616356   
2026                           1.0          2.6989700043360187  
203                            3.0          2.221848749616356   
2030                           3.0          2.221848749616356   
2035                           1.0          2.6989700043360187  
204                            2.0          2.3979400086720375  
2040                           1.0          2.6989700043360187  
20425575                       1.0          2.6989700043360187  
2043                           1.0          2.6989700043360187  
20433                          1.0          2.6989700043360187  
2044594                        1.0          2.6989700043360187  
2045                           1.0          2.6989700043360187  
205                            8.0          1.7958800173440752  
2050                           2.0          2.3979400086720375  
2052                           1.0          2.6989700043360187  
2059                           1.0          2.6989700043360187  
206                            4.0          2.0969100130080562  
20622542                       1.0          2.6989700043360187  
2067                           1.0          2.6989700043360187  
207                            4.0          2.0969100130080562  
2070                           1.0          2.6989700043360187  
2077                           1.0          2.6989700043360187  
208                            13.0         1.585026652029182   
2080                           2.0          2.3979400086720375  
20814881                       1.0          2.6989700043360187  
2085                           1.0          2.6989700043360187  
20894                          1.0          2.6989700043360187  
209                            6.0          1.9208187539523751  
20952182                       1.0          2.6989700043360187  
20997                          1.0          2.6989700043360187  
21                             102.0        0.6903698325741012  
210                            4.0          2.0969100130080562  
2101                           1.0          2.6989700043360187  
211                            4.0          2.0969100130080562  
212                            4.0          2.0969100130080562  
212018                         1.0          2.6989700043360187  
213                            2.0          2.3979400086720375  
2134                           1.0          2.6989700043360187  
2139                           1.0          2.6989700043360187  
214                            2.0          2.3979400086720375  
215                            7.0          1.853871964321762   
21532796                       1.0          2.6989700043360187  
2155                           1.0          2.6989700043360187  
21664980                       1.0          2.6989700043360187  
217                            1.0          2.6989700043360187  
2171                           1.0          2.6989700043360187  
2172                           1.0          2.6989700043360187  
2174                           3.0          2.221848749616356   
218                            3.0          2.221848749616356   
2185                           2.0          2.3979400086720375  
219                            3.0          2.221848749616356   
21945152                       1.0          2.6989700043360187  
2195                           1.0          2.6989700043360187  
22                             88.0         0.7544873321858502  
220                            10.0         1.6989700043360187  
2205145                        1.0          2.6989700043360187  
22090470                       1.0          2.6989700043360187  
221                            4.0          2.0969100130080562  
2218                           1.0          2.6989700043360187  
22195                          1.0          2.6989700043360187  
222                            5.0          2.0                 
223                            4.0          2.0969100130080562  
223159687                      1.0          2.6989700043360187  
224                            1.0          2.6989700043360187  
2247                           1.0          2.6989700043360187  
2249                           2.0          2.3979400086720375  
225                            7.0          1.853871964321762   
2258                           1.0          2.6989700043360187  
226                            3.0          2.221848749616356   
22616870                       1.0          2.6989700043360187  
227                            4.0          2.0969100130080562  
2273                           1.0          2.6989700043360187  
228                            4.0          2.0969100130080562  
229                            2.0          2.3979400086720375  
2290                           2.0          2.3979400086720375  
2295                           1.0          2.6989700043360187  
2296                           1.0          2.6989700043360187  
23                             88.0         0.7544873321858502  
230                            6.0          1.9208187539523751  
2303                           2.0          2.3979400086720375  
2309                           1.0          2.6989700043360187  
231                            4.0          2.0969100130080562  
2312                           1.0          2.6989700043360187  
231551026                      1.0          2.6989700043360187  
232                            4.0          2.0969100130080562  
232018                         1.0          2.6989700043360187  
233                            4.0          2.0969100130080562  
23356638                       1.0          2.6989700043360187  
2337                           1.0          2.6989700043360187  
234                            2.0          2.3979400086720375  
2340                           1.0          2.6989700043360187  
23443                          1.0          2.6989700043360187  
23450                          1.0          2.6989700043360187  
23456789102030405060           1.0          2.6989700043360187  
2346                           1.0          2.6989700043360187  
235                            3.0          2.221848749616356   
23525994                       1.0          2.6989700043360187  
2354                           1.0          2.6989700043360187  
